

{
  "pages": [
    {
      
      
      
      "content": "\n",
      "url": "/404.html"
    },{
      
      "title": "CHANGELOG",
      
      "content": "CHANGELOG\n\n\n  v9.0.3\n  v9.0.2\n  v9.0.1\n  v9.0.0    \n      Major\n      Minor\n      Design\n      Fixes\n    \n  \n  v8.5.2\n  v8.5.1\n  v8.5.0    \n      Changed\n      Added\n      Fixed\n    \n  \n  v8.4.0\n  v8.3.0    \n      Added\n      Changed\n    \n  \n  v8.2.0\n  v8.1.1    \n      Fixes\n    \n  \n  v8.1.0    \n      Breaking\n      Changed\n      Added\n    \n  \n  v8.0.0    \n      Breaking\n      Changed\n      Added\n      Fixes\n    \n  \n  v7.5.1    \n      Changed\n    \n  \n  v7.5.0    \n      Added\n      Fixed\n      Other\n    \n  \n  v7.4.2    \n      Fixed\n    \n  \n  v7.4.1    \n      Fixed\n    \n  \n  v7.4.0    \n      Added\n      Fixed\n      Design\n      Other\n    \n  \n  v7.3.0    \n      Added\n      Fixed\n    \n  \n  v7.2.0    \n      Added\n      Design\n      Fixes\n    \n  \n  v7.1.1    \n      Fixes\n    \n  \n  v7.1.0    \n      Changed\n      Fixes\n      Content\n    \n  \n  v7.0.1    \n      Fixes\n      Content\n      Removed\n    \n  \n  v7.0.0    \n      License Change\n      Breaking\n      Changes\n      Added\n      Performance\n      Design\n      Fixes\n    \n  \n  v6.6.1\n  v6.6.0\n  v6.5.0    \n      Added\n      Changed\n      Design        \n          How to restore the old styles\n        \n      \n    \n  \n  v6.4.1\n  v6.4.0    \n      Minor\n      Design\n      Fixes\n    \n  \n  v6.3.0    \n      Minor\n      Design\n      Fixes\n    \n  \n  v6.2.0\n  v6.1.1\n  v6.1.0\n  v6.0.0 (JavaScripten)    \n      Major\n      Minor\n      Fixes\n    \n  \n  v5.3.0\n  v5.2.0\n  v5.1.0\n  v5.0.0 (The Fast One)    \n      Major\n      Minor\n      Trivia\n    \n  \n  v4.0.1\n  v4.0.0 (Social Media Impocalypse)    \n      Breaking\n      New features\n      Design\n      Fixes\n      Internal\n    \n  \n  v3.0.0 (Hydejack)    \n      Features\n    \n  \n  v2.0.0 (Hyde)\n  v1.0.0 (Hyde)\n\n\nv9.0.3\nJuly 9 2020\n\n\n  Updated print resume style\n  Updated docs for GitHub Pages\n  Slightly decreased size of dark mode icon\n  Fixed a bug that caused a GitHub Pages build to fail with an empty configuration file\n  Changed default icon so that it less resembles slashdot.org~~\n\n\nv9.0.2\nJuly 7 2020\n\n\n  Fixed a bug that prevented the search from updating when offline is enabled\n  Fixed a bug that caused search terms to get lost during initialization\n  Fixed a bug that prevented site.legal from getting stored for offline during service worker installation\n  Added support to for no-cache param to service worker.\n\n\nv9.0.1\nJuly 6 2020\n\n\n  Changing app icons has been revamped. See this section in the docs.\n  Changed default icons\n  Changed default sidebar background\n  Added jekyll-compose defaults to config file\n  Slightly adjusted dark mode colors\n  Fixed resume layout breakpoint\n\n\nv9.0.0\nJuly 3 2020\n\nMajor\n\n  \n    Added Built-In Search Functionality\n\n    Hydejack now has its own built-in search solution, that integrates well with the existing page style and the new navbar.\n\n    The solution is entirely browser-based which means it even works while offline and doesn’t depend on an 3rd party. \nThis works, because Hydejack is designed for personal sites that generally have less than 1000 pages. \nIn my testing, Jekyll build times have been a problem long before search query times.\n\n    The results of the search are surprisingly good, but have only been tested in English and (somewhat) German. \nFor better language support, I might build an integration with Algolia at some point, which has the best results, \nbut requires stable internet connection and an API key. \nI’d be interested to hear about problems with search in other languages to determine if this is necessary.\n  \n  \n    Added Table of Contents that is prettier, sticky, and dynamic.\n\n    Adding a table of contents is part of kramdown and can be done in all versions of Hydejack. \nHowever, v9 adds a dynamic version that will stick to the 3rd column on large screens and highlight the current section.\n\n    Note that this will reduce the amount of space freed up by the no_break_layout: false setting (otherwise the ToC would overlap with code blocks, math blocks, etc).\n  \n  \n    Added a scroll-linked navbar that disappears when scrolling down and re-appears when scrolling up.\n  \n  \n    Math support has been revamped because the old solution stopped working with Jekyll 4. Hydejack now supports both KaTeX and MathJax.\n\n    The MathJax implementation is more similar to the old solution. It comes with a client-side runtime (MathJax in this case)\nand works on GitHub Pages. It is the more heavy-weight of the two and doesn’t work without JavaScript enabled. \nDue to the size of the complete MathJax package, it only works partially with offline support enabled.\n\n    The KaTeX implementation has been changed to pre-render the KaTeX output during site building.\nIt does not ship a client-side runtime, which is more lightweight and works without JavaScript.\nIn my opinion, it is the more elegant solution, but it requires a JavaScript runtime on the machine that builds the site.\nThis means that this solution doesn’t work on GitHub Pages.\n\n    You can switch between the two implementations by changing the kramdown.math_engine key to either katex or mathjax in your config file.\nThe KaTeX implementation also requires the kramdown-math-katex gem in your Gemfile.\n  \n  \n    Drastically improved build times through the use of jekyll-include-cache. \nMost of the previous tips on improving page build speed should now be obsolete.\n  \n  \n    Added grid layout in PRO version that mirrors the projects layout, but for posts. \nIf you’ve set images for your posts, it will give your blog a more modern look.\n  \n\n\nMinor\n\n  CSS variables are now configurable via _data/variables.yml. While there are other ways to change them, this has the broadest reach across HTML (img[sizes] attribute!), CSS and JS.\n  Many JS content features (such as # heading links) now work even when hydejack.no_push_state is enabled.\n  Linking to posts in the home and post layout now accept either paths or URLs. Read more.\n  The star icons in the resume layout can now be disabled via no_skill_icons and no_language_icons.\n  Resume layout now supports the following keys: born, citizenship, and maritalStatus.\n  PRO only: Added hide_dates option to disable showing blog post dates.\n  The blog layout now works without pagination, simply showing all posts on a single page when the jekyll-pagination plugin is not found.\n  The projects, resume, and grid layout now make better use of large screens, by letting content expand to the right of the screen. Restore the previous , set no_break_columns in front matter.\n  Removed smooth scroll polyfill for Safari/Webkit as it has caused problems with sticky content.\n  Figure captions can now be added to code blocks, math blocks, and tables in addition to just images using the .figcaption CSS class.\n  The order of the comment section relative to the about and related posts sections can now be customized via the hydejack.post_addons and hydejack.project_addons keys. See the example _config.yml for more.\n  Clicking the image in the blog layout will now navigate to the blog post. In the PRO version it will do so with the classic “move image in place” animation.\n  Grouping projects by year can now be disabled. Use no_groups: true in the front matter. This also applies to the new grid layout and the old list layout.\n  hy-img has been removed and replaced with browser’s native loading=lazy attribute\n  Now serving separate JavaScript files for old and new browsers, allowing it to take advantage of many new language features.\n  JavaScript files are now chunked, so that only what is needed is loaded on demand.\n  hy-drawer and hy-push-state have been rewritten in TypeScript and LitHTML, fixing many bugs in the process.\n  Updated to Jekyll 4.1\n  Hydejack now has a dedicated offline page that will be shown when the client is offline and tries to open a page that hasn’t been cached. \nThe content of the page can be customized by creating offline.md file in the root with layout: offline, similar to 404.md.\n  The code font can now be customized in the config file via the font_code key.\n\n\nDesign\n\n  Many layouts (projects, resume, home) will now use more space on large screens (disable via hydejack.no_third_column)\n  Headings now appear “oversized” on larger screens and extend to the right end of the screen (disable via hydejack.no_large_headings)\n  The base font size is now smaller across screen sizes (can be configured in _sass/_variables.scss)\n  The content width is now larger across screen sizes (can be configured in _sass/_variables.scss)\n  The link style has been changed to make picking accent colors easier for dark mode. It’s also possible to link images now without worrying about underlines.\n  The amount of whitespace has been reduced. Previously it had been increased but it felt too much.\n  Added a note class that succeeds the message for adding auxillary content. The message class still exists.\n  The navbar buttons made to look more like buttons\n  Dark mode colors have been toned down a bit\n  Improved dark mode text rendering on macOS\n  The permalink style has been changed to use “#” instead of an icon.\n  Definition list now have a double colon after the definition term.\n  Changed the style of footnote links on small screens to make them easier to click.\n\n\nFixes\n\n  Horizontal scrolling on a code block, math black, or table can no longer accidentally open the drawer.\n  The client-side scripts are now more robust to missing HTML elements. This should ease theme customization.\n  Setting sitemap: false will now also add a noindex meta tag to prevent accidental search engine indexation.\n  Fixed back button not showing when opening in standalone mode for the first time.\n  The menu icon is now hidden when the drawer is disabled.\n  Using no_drawer: true is now working properly on cover pages when no_push_state: false is set.\n  Reduced the amount of pixels cached by the will-change optimization and fixed the corresponding warning in Firefox.\n\n\nv8.5.2\nAugust 31 2019\n\n\n  Fixed breaking builds due to name collision when upgrading to 8.5\nThis is caused when using both _plugins/jekyll-replace-imgs and the new jekyll-replace-img ruby gem.\nI recommend deleting _plugins/jekyll-replace-imgs when using the jekyll-replace-img gem.\nNote that this is an optional plugin.\n  Fixed nomodule script loading for Safari 10.1\n  Fixed #176\n\n\nv8.5.1\nAug 1 2019\n\n\n  Fixed minification bug\n\n\nv8.5.0\nAug 1 2019\n\nChanged\n\n  [PRO] The theme now matches the operating system’s dark mode.\n  Scrolling down on a page with an open drawer will now close the drawer\n  Reloading a cover page after the drawer has been closed will now open the page with the drawer closed\n  Removed JavaScript-based web font swapping in favor of using font-display: swap\n  Darkened font color in dark mode to reduce contrast\n  Updated KaTeX to the latest version\n  Increased the durations of various animations slightly\n  Now using jekyll-replace-img instead of custom code in _plugins folder\n  Added a separate, smaller JavaScript bundle for modern browsers\n\n\nAdded\n\n  Added support for figure captions on code blocks\n  Added keybase to social media icons\n  [PRO] There’s now a forward button when using the theme as a PWA\n\n\nFixed\n\n  Fixed print layout when dark mode is enabled\n  Using CSSTransformValue correctly\n  Fixed a minor style bug for dates\n  Fixed a bug where light mode would flash when loading a page in dark mode\n  Minimal support for IE11\n\n\nv8.4.0\nMar 9 2019\n\n\n  Added support for noindex property in the front matter\n  Fixed ordering of selected projects/post in welcome layout\n  Updated dependencies\n\n\nv8.3.0\nFeb 18 2019\n\nThis version adds new options to increase production build speed. Read this post for details.\n\nAdded\n\n  Added no_page_style config option to increase site build speed.\n  Added menu config option to increase site build speed.\n  Copying math will now add the LaTeX source to the clipboard.\n\n\nChanged\n\n  Upgraded KaTeX to version 0.10.0.\n\n\nv8.2.0\nFeb 1 2019\n\n\n  Added support for custom related_posts\n  Removed footer from print layout\n  Increased photo size in print resume\n  Improved welcome layout generation performance\n  Fixed a bug that prevented scrolling to headlines with non-ascii characters (Thanks @ForelaxX)\n\n\nv8.1.1\nSep 1 2018\n\nFixes\n\n  Fixed an issue that prevented the drawer from working on iOS 10.\n  Changing the page via push state will now also update the link[rel=canonical] tag.\n  Changing the page via push state will now also update the meta[name=description] tag.\n  Fixed an issue that prevented the JS from building on Netlify.\n\n\nv8.1.0\nAug 18 2018\n\nThis release adds Dark Mode for Hydejack PRO customers.\n\nBreaking\n\n  Removed cookie banner from free version\n  Removed offline support from free version\n\n\nIn an attempt to make the PRO offering more appealing, I’m removing features that arguably should have never been included in the free version.\nAs software licenses go, nobody is stopping you from using the old code, but updates will no longer be included.\n\nChanged\n\n  The cookies banners is now showing at the bottom of the page and its background color is no longer transparent to increase visibility\n  Changed the default syntax theme from “GitHub” to “Atom One Light”\n  Adapted figure CSS class to accommodate different children, not just imgs\n  video tags now have a max-width of 100%\n  Increased margin before headings to 5rem, up from 4\n  Increased margin of hr elements.\n  Cookies banner can now be enabled without using Google Analytics\n  Clicking the cookie banner “Okay” button will now fire a hy--cookies-ok event on document, so that custom analytics solutions can plug in.\n  All Google Analytics code has been removed from Hydejack’s core and moved to _includes/body/analytics.js.\n  All Disqus code has been removed from Hydejack’s core and moved to _includes/comments.html and _includes/my-comments.html.\n  Using CSS Custom Properties instead of SASS variables for certain properties to enable style customization using only CSS.\n  Added shadow to sidebar\n  Navbar is longer positioned fixed\n\n\nAdded\n\n  [PRO] Added Dark Mode\n  border CSS class\n\n\nv8.0.0\nJul 16 2018\n\nSo far Hydejack has been a decent Jekyll theme, but with v8 it really starts stand out among the competition: Beautiful and unique landing pages, lazy-loading images, and experimental offline support are just the most prominent new features.\n\nBreaking\n\n  \n    The expected format for sidebar images has changed.\nA sidebar image should now be a full-screen ~16:10 image.\n\n    Comment: The sidebar can now be fully extended on desktop, which generally requires a large landscape image to fill the entire window.\nTo save bandwidth, you can blur the image on the left and right edges and save it as JPG.\n  \n  \n    The about and welcome layout no longer prepend the content with the author information.\nInstead, the author info can be shown by adding the &lt;!--author--&gt; marker to the top of the file. You can also place it anywhere else.\n\n    Comment: Showing the author description on the top of the welcome and about layouts felt like an imposition and was a left-over from when I was developing Hydejack primarily for myself.\n  \n  \n    [PRO] The welcome layout no longer adds recent posts and projects to the bottom of the page. Instead, they have to be explicitly set using the &lt;!--posts--&gt; and &lt;!--projects--&gt; markers. The content_separator front matter opton is now ignored.\n\n    Comment: The old behavior felt arbitrary, and &lt;!--more--&gt; wasn’t a good name to be replaced with recent projects ands posts.\n  \n  \n    Setting the accent color and sidebar image for an entire category/tag/author is no longer possible.\nTo achieve a similar effect, use Front Matter defaults instead.\n\n    E.g. to set the accent color and image for every post in the hydejack folder, use:\n\n    defaults:\n  - scope:\n      path:         hydejack\n    values:\n      accent_color: rgb(38,139,210)\n      accent_image: /assets/img/hydejack-bg.jpg\n    \n\n    Comment: The code to find the color for a given page was complicated and slow (potentially iterating all categories/tags to find the right one).\n  \n\n\nChanged\n\n\n  The drawer now responds to mouse inputs.\n  The default heading font is now less bold. To restore the old behavior, edit (create if it’s missing) _sass/my-variables.scss and add $font-weight-heading: 700;.\n  Hydejack now uses lazy-loading hy-img tags instead of regular img tags.\nTo revert to using regular images, set hydejack.no_img in the config file to true.\n  Cookie consent is now stored as a cookie (instead of LocalStorage) and expires after 1 year.\n  Scrolling to a fragment link is now smooth.\n  Font loading now works differently, and will be cancelled on slow connections.\n  The sidebar content is now centered.\n  The sidebar will now show the site’s logo, which can be set in the config file under the logo key.\n  [PRO] Updated embedded Bootstrap to v4.\n  [PRO] Project cards now throw a shadow instead of having a border.\n\n\nAdded\n\n  \n    Pages can now have the cover key in the front matter.\nWhen set to true, the sidebar will be opened when visiting the page directly.\nE.g. https://hydejack.com/\n  \n  \n    Added a _plugin that automatically replaces &lt;img&gt; tags with lazy-loading &lt;hy-img&gt; tags. If you don’t want images to load lazily, delete or rename the _plugins folder.\nNote that this plugin will never run when building the site on GitHub Pages.\n\n    To get the most out of this plugin, it is recommended to provide the width and height of the image, e.g.\n\n    ![Some image](assets/img/some-img.png){:width=\"800\" height=\"600\"}\n    \n\n    This will cause hy-img to render a placeholder of 800 by 600 px, preventing the document height from changing after the image has finished loading.\n  \n  \n    Added experimental offline support via Service Workers. Use with care!\nFor details, read the docs.\n  \n  \n    Added the figure CSS class, which allows images to have nicer-looking captions. E.g.\n\n    ![An image with a caption](https://placehold.it/800x50){:.lead}\nA caption to an image.\n{:.figure}\n    \n  \n  \n    Clicking on a footnote will give its corresponding text a subtle highlight.\n  \n  \n    [PRO] Projects can now have an optional end_date field in the front matter.\nThe date is treated as the start date in this case.\n  \n\n\nFixes\n\n  The back button now works in combination with fragment links.\n\n\nv7.5.1\nApr 2 2018\n\nChanged\n\n  Moved from browserify to webpack\n  Updated ruby dependencies\n  Updated JS dependencies\n  Updated hy-push-state and hy-drawer to latest versions\n\n\nv7.5.0\nDec 18 2017\n\nAdded\n\n  \n    Added secondary legal nav in footer:\n\n    # file: `_config.yml`\nlegal:\n  - title: Cookies Policy\n    href:  /cookies-policy/\n  - title: Foobar\n    href:  https://foobar.com/\n    \n  \n  \n    The “heading permalink” can now be configured via strings.yml:\n\n    # file: `_data/strings.yml`\npermalink:      Permalink\npermalink_icon: icon-link\n    \n  \n  \n    Sections on resume layout can now be rearranged, e.g.:\n\n    # file: `resume.md`\nleft_column:\n  - work\n  - volunteer\n  - education\n  - awards\n  - publications\n  - references\nright_column:\n  - languages\n  - skills\n  - interests\n    \n  \n\n\nFixed\n\n  Fixed a bug that caused &lt;sup&gt; tags to render as regular text (#52)\n  Fixed a bug that caused Disqus to load the same thread on all pages (#53)\n  Fixed a bug that prevented Disqus comments to be loaded on sites that didn’t cause scroll events\n  Fixed a bug that caused Disqus to be loaded over HTTP instead of HTTPS.\n  Fixed a bug that caused an extra space in URLs (#55).\n  Comments no longer show up in the print version of the page.\n\n\nOther\n\n  Set base font to 11pt in print layout.\n  Set resume print layout to use 2 columns (A4 sheet)\n\n\nv7.4.2\nDec 1 2017\n\nFixed\n\n  Dramatically improved resume print layout.\nIt is now much less likely that there will be page breaks within logical units.\n  Fixed a bug that cause the page to break when setting no_drawer.\n  Fixed a bug that cased the “Random Posts” heading to appear, even when there are no posts to show\n\n\nv7.4.1\nNov 27 2017\n\nFixed\n\n  Fixed storing user-related data before accepting cookies.\n  Fixed tab order of cookie banner, so keyboard users can access it more easily.\n  Accepting cookies no longer causes a page reload in some browsers.\n  Fixed appearance of the okay button in the free version.\n  Menu icon now useable while the cookies banner is active.\n  Loading icon is now visible while the cookies banner is active.\n  Removed cookies banner from print layout.\n  Removed inline styles from cookie banner.\n\n\nv7.4.0\nNov 25 2017\n\nAdded\n\n  Allow markdown in copyright string\n  Added theme_color front-matter property to micro-manage the value of the the theme-color meta tag.\nWhen not set, will use accent_color.\n  Added theme_color site setting, to set the value of themeColor in the app manifest.\nWhen not set, will use accent_color.\n  \n    Added cookies_banner setting:\n\n    # file: `_config.yml`\nhydejack:\n  cookies_banner: true\n    \n\n    Enabling this setting will show a notice at the top of the page to new visitors.\nYou can change the wording of the notice in _data/strings.yml\nwith the cookies_banner.text and cookies_banner.okay keys:\n\n    # file: `_data/strings.yml`\ncookies_banner:\n  text: This site uses cookies.\n  okay: Okay\n    \n  \n\n\nFixed\n\n  Drawer no longer resizes/repaints in iOS Safari (iPhone) and Chrome for Android when the address bar autohides.\n  Fixed a bug that caused the drawer flicker/open unexpectedly when scrolling in mobile browsers.\n  Fixed how image works when using the jekyll-seo-tag plugin.\n\n\nDesign\n\n  Changed how line breaks work in resume layout\n  Changed margins of horizontals lines\n\n\nOther\n\n  Updated docs\n  Updated posts\n\n\nv7.3.0\nNov 17 2017\n\nAdded\n\n  Allow markdown content on projects layout.\n  Renamed big_project option on projects to featured (big_project still works)\n\n\nFixed\n\n  Fixed default font weights\n  Fixed hard-coded /projects/ URL in project layout\n  Link to feed.xml is only generated when using the jekyll-feed plugin\n\n\nv7.2.0\nNov 13 2017\n\nAdded\n\n  Added _sass/my-variables.scss file, which you can use to selectively override SCSS variables.\n  Font weights can now be configured via SCSS variables:\n    \n      $font-weight for normal font.\n      $font-weight-bold for strong tags and similar.\n      $font-weight-heading for headings.\n    \n  \n\n\nDesign\n\n  Message boxes will no longer span the full width, even with the break layout feature enabled.\n  Increased space between project card rows, so they look less like a brick wall.\n\n\nFixes\n\n  Reduced the draw range of the drawer on iOS, so that a larger portion of the screen is available for zooming (a11y).\n  Default images are now optimized, so they are no longer flagged by Google PageSpeed Insights and similar tools.\n  Query parameters are no longer used for cache busting.\nInstead, the version number is no part of the file name for the CSS and JS resources.\n\n\nv7.1.1\nNov 3 2017\n\nFixes\n\n  Fix IE11 feature detection\n\n\nv7.1.0\nNov 2 2017\n\nChanged\n\n  Renamed no_description to hide_description.\nSince this feature isn’t yet documented outside of the change log, the old name will not continue to work.\n  When providing images to image, image.path, image.src, image.srcset and accent_image ,\nit is no longer necessary to prepend the url with the baseurl of the site,\ne.g. values like accent_image: /assets/img/sidebar-bg.jpg are now valid.\n  Limited scope of a and img styles to content areas.\n  Upgraded KaTeX to v0.8.3\n  Upgraded jekyll-relative-links to v5.0.1\n\n\nFixes\n\n  font and font_heading are now properly set when using the no_inline_css option #47.\n  Fixed default values for image and logo that were referring to non-existing images.\n  Added missing JS dev dependencies.\n\n\nContent\n\n  Updated documentation\n  Updated index, download, about and README pages.\n\n\nv7.0.1\nOct 27 2017\n\nFixes\n\n  Removed readme files from assets that would show up as pages when building on GitHub Pages #42.\n  Disabled push state on Firefox for iOS\n  Changed some default settings in _config.yml\n\n\nContent\n\n  Updated documentation\n\n\nRemoved\n\n  Removed outdated example script in my-scripts.html\n\n\nv7.0.0\nOct 24 2017\n\nLicense Change\nThe free version of Hydejack is now GPL-3.0 licensed, which is a more restrictive license than MIT (but still Open Source).\nThis was necessary because the two major components that make up Hydejack,\nhy-push-state and\nhy-drawer,\nare now GPL licensed in turn.\n\nHow will this affect you?\n\n  If you bought the PRO version you are not affected at all.\n  You can continue to use previous versions of Hydejack according to their license (MIT).\n  If you upgrade, keep the source code in a public repository and make sure you include the new LICENSE.md file.\nDO NOT publish the new code with an old license.\n  If you upgrade and make changes to the source code, you are required to make those changes available to the public\nunder a GPL-3.0 compatible license.\n\n\nThe full license text is available here.\nYou can read a summary on tl;drLegel.\n\nIf this change is not acceptable to you, DO NOT upgrade or consider buying a PRO license.\n\nNote that the above does not constitute legal advice.\n\nBreaking\nThis is a major release, but almost all options and APIs that were described in the docs continue to work.\nSome names have changed and are no longer mentioned in the docs, but they are still part of the code and continue to work.\n\nThat being said, you should be aware of these (small) breaking changes:\n\n\n  \n    The favicon is now located in assets/icons. To change the favicon of the page, edit favicon.ico (png) in the folder.\n  \n  \n    Changed the way tables work, so that they do the right thing more often.\nTables are now scrollable by default, but small tables are no longer stretched to span the full width.\nSetting scroll-table on a larger table is sill recommended, as it will set white-space: nowrap.\n  \n  \n    Autogenerated ids for posts now look like post-2017-01-01-my-title instead of post-2017/01/01/my-title.\n  \n  \n    Event names described in the scripting chapter have changed from y-push-state-* to hy-push-state-*,\nexcept y-push-state-animationend, which has been removed. See the docs for more.\n  \n\n\nChanges\n\n  \n    image has been renamed to accent_image, but image continues to work unless you add the jekyll-seo-tag plugin.\nThis change was necessary because jekyll-seo-tag uses the image keyword to set the thumbnail image of a page.\nWhile it may be desirable to use the same image for both the sidebar and the thumbnail,\nthe new preferred way to set sidebar images is by using the accent_image key.\n  \n  \n    color has been renamed to accent_color to be consistent with the new accent_image key, but color continues to work.\n  \n  \n    Various options that do not make sense outside the context of Hydejack (like no_push_state or no_drawer)\nhave been moved under a common hydejack key. However, the old options continue to work.\n\n    hydejack:\n  no_push_state: false\n  no_drawer: false\n    \n  \n  \n    All plugins (gems) are now optional.\nThe gem-based version of the theme no longer uses any plugins by default,\nwhile the download version follow a “batteries-included” approach and enables some by default.\n  \n  \n    Links to the /assets/ folder are no longer intercepted by the push state features,\nwhich means clickable images and download links should work fine now.\n  \n  \n    Reader views in Firefox and Safari have an easier time recognizing the main content.\n  \n  \n    [Internal] No more &lt;style&gt; tags in the body.\n  \n  \n    [Internal] Content that is generated via JS (error pages, loading, etc…) is now cloned from template tags,\nwhere it is easier to modify (but before you do, check out the new _data/strings.yml file).\n  \n  \n    [Internal] Changed how CSS code is organized.\nPreviously there were two versions of each CSS file for each ‘topic’,\none containing core styles to be inlined into the page, the other containing those fetched asynchronously via link tag.\nNow there is only one file per topic, with the parts to be inlined/linked marked with comments.\nA script has been added to “split” the CSS into the inline/link parts.\nNote that this does not affect your my-*.scss files.\n  \n  \n    [Internal] Many CSS classnames have changes, specifically those that would conflict with Bootstrap class names.\n  \n  \n    [Internal] Many files in _includes have been reorganized, specially head.html and body.html have been broken up into smaller parts.\n  \n  \n    [Internal] The y-drawer component (MIT) has been replaced with the hy-drawer component (GPL-3.0).\n  \n  \n    [Internal] The y-push-state component (MIT) has been replaced with the hy-push-state component (GPL-3.0).\n  \n\n\nAdded\n\n  \n    The theme now has support for the jekyll-seo-tag plugin.\nTo use this gem, make sure you use the latest Gemfile and Gemfile.lock and run bundle install.\nIn your config file, add jekyll-seo-tag to plugins (formerly called gems).\n  \n  \n    All texts that were previously hard-coded into the theme can now be configured via _data/strings.yml.\nThis makes it possible to change certain phases without having to change source files,\nbut it should also make it easier to use Hydejack with other languages.\nTime and date formats can also be configured, using Ruby’s\nformat directives.\n  \n  \n    The lang key now accepts values like en-us or de_AT.\n  \n  Made the site “mobile web app capable”\n    \n      Added manifest.json for “Add to Homescreen” support on Android\n      Added theme-color meta tag that matches the accent_color and changes dynamically\n      Added apple-mobile-web-app-* meta tags\n      Added ieconfig.xml for “Pin to start menu” support in Windows 10.\n      Old icons and new ones are now located in assets/icons.\n    \n  \n  \n    Hydejack now marks up content as structured data, to the extent possible.\nThe resume is provided as https://schema.org/Person\nas well as hCard,\nwhile projects are provided as https://schema.org/CreativeWork.\nYou can use the Structured Data Testing Tool to see the results.\n\n    If you do not want to expose your data in machine-readable form, you can set the no_structured_data flag to true in your config file.\n\n    hydejack:\n  no_structured_data: true\n    \n\n    Note that this only applies to the resume and project layout, not the data generated by by jekyll-seo-tag\n(Facebook Open Graph and Twitter cards).\n  \n  \n    [PRO] Added “big projects”. You can make a project card span the entire content width (instead of half),\nby setting big_project to true in the project’s front matter.\n  \n  \n    [PRO] The welcome layout now has a content_separator option,\nwhich allows content to move below the “Selected/Latest Projects” and “Selected/Latest Posts” section.\nUsage:\n\n    ---\nlayout: welcome\ncontent_separator: &lt;!--more--&gt;\n---\n\nContent above\n\n&lt;!--more--&gt;\n\nContent below\n    \n  \n  \n    [PRO] The PRO version now has built-in support for Tinyletter.\nTo show a newsletter subscription box below each post, set tinyletter: &lt;username&gt; in your config file.\nIf you want to use a different mailing provider, you can add your own form in _includes/my-newsletter.html.\n  \n  \n    [PRO] The PRO version now includes styles for input elements, using the same CSS class names as Bootstrap.\nCheck out the Bootstrap docs to learn more.\n  \n  \n    [PRO] Added links to random posts at the bottom of each post. This can be beneficial for search engine rankings and content discovery.\nYou can remove them with the new post_addons option (see below).\n  \n  \n    [PRO] If a endDate is missing in your resume.json, it will render as “&lt;startDate&gt; – present”.\nYou can change the wording in the new strings.yml file.\n  \n  \n    Added support for jekyll-avatar.\nIf this plugin is enabled in your config file, it will show the avatar of your github account\n(author.social.github, author.github.username author.github).\n  \n  \n    Added support for jekyll-gist.\n  \n  \n    You can now add links to external sites in the sidebar.\nCreate a file like something.md and add a title, menu, order (optional) and a redirect_to field to the front matter, e.g.:\n\n    ---\ntitle: External\nmenu: true\nredirect_to: https://example.com/\n---\n    \n\n    You may combine this with the jekyll-redirect-from plugin\nto generate a redirect page, but this is optional.\n  \n  \n    You can now configure the order of complementary content below posts and projects.\nBy default, Hydejack will show the author first (if any), the newsletter box next (if any),\nand related posts/projects last.\n\n    hydejack:\n  post_addons:    [about, newsletter, related, random]\n  project_addons: [about, newsletter, other]\n    \n\n    To change the order in the output, change to order in the array.\nYou can also drop entries from the output by removing them from the list.\n  \n  \n    Added an error page that is shown when client-side network errors occur. It contains a link to retry loading the page.\nPreviously, the browser’s default error page would have been shown.\n  \n  \n    Added hide_description option to pages to prevent the content of description fields to show up in the output.\nThis allows you to use the description field in the front matter to set descriptions for search engines and sharing on social media,\nwithout having to worry about the output.\n\n    You can activate this for all pages by adding to your config file:\n\n    defaults:\n  - scope:\n      path: ''\n    values:\n      hide_description: true\n    \n  \n  \n    Added a new option called no_inline_css.\nWhen true, Hydejack will generate a single CSS file to be fetched (synchronously) via link tag,\ninstead of inlining half and including the rest via link tag.\n\n    This option may be useful when serving content over HTTP/2, but you should perform your own tests.\nFor more on inlining CSS, see this.\n\n    hydejack:\n  no_inline_css: true\n    \n  \n  \n    Added dns-prefetch links to Google Fonts and Google Analytics domains to further boost page load speed.\nThese are only included when using Google Fonts/Analytics.\n  \n  \n    You can now define an arbitrary CSS background for the sidebar instead of just images, e.g.:\n\n    accent_image:\n  background: 'linear-gradient(to bottom, rgba(35,62,76,1) 0%,rgba(60,146,158,1) 50%,rgba(213,213,212,1) 100%) #4fb1ba'\n    \n  \n  \n    Category and tag pages can now have arbitrary content (to be shown above the list).\n  \n  Links can now be marked for FLIP animations by adding the flip-title class. Use this for links that have\nthe exact same text as the title of the page they are linking, e.g. [NOTICE](/AlphaBetEcon/NOTICE/){:.heading.flip-title}.\n\n\nPerformance\n\n  Reduced building time during development.\nRoughly 50% of the time was spent rebuilding the inline CSS, which is now built once and included via link tag.\nProduction builds still inlines CSS, so the building speed remains unchanged.\nFor more on how to improve building speeds, see here.\n\n\nDesign\n\n  \n    The default background image is no longer anti-selling the theme…\n  \n  \n    Code blocks, math blocks and tables now use as much space as there is available on the screen.\nLimiting the line length makes sense for paragraphs, as they are more difficult to read\nwhen they span the entire length on a large display,\nbut it is less useful for content, like tables, long formulas or code.\n\n    If you do not like this change, you can set no_break_layout to true in your config file.\n\n    hydejack:\n  no_break_layout: true\n    \n  \n  \n    Margin below code blocks, math blocks and tables increased from 1rem to 2rem.\n  \n  \n    Gray text now has a higher contrast ratio:\nI don’t want anybody to “suffer from design”.\n  \n  \n    Reduced the number of responsive breakpoints.\n  \n  \n    Added a hover effect on project images.\n  \n  \n    On mobile, footnotes will be shown as [1] instead of superscript, making them easer to tap.\n  \n  \n    The sidebar now has a subtle shadow on mobile, to indicate that it can be drawn from the side.\n  \n  \n    The sidebar now has less margin on the sides.\n  \n  \n    The sidebar now fits 5 social media icons, up from 4.\n  \n  \n    The description in the sidebar now has a smaller font size when it is longer than 100 characters.\nThis is to encourage writing a longer description for search engines (~160 characters).\n  \n  \n    h1, h2 and h3 headings now have different line-heights to improve readability when they span multiple lines.\n  \n  \n    Marks on external links are now less opaque, but have a hover effect.\n  \n  \n    More responsible usage of font_heading in resume layout.\n  \n  \n    When hovering over a headline, a # link will appear, so that readers can link to individual headlines.\n  \n  \n    Changed the loading spinner to use a single icon instead of several animated divs.\n  \n\n\nFixes\n\n  When linking to an internal document that doesn’t match the regular content structure,\nthe ‘hot replacement’ will no longer get stuck, and reload the page instead.\n  Fix jumping to # links after navigating to a new page.\n  Fix jumping to # links in MS Edge.\n  Fixed a bug on iOS were scrolling was blocked after closing the drawer.\n  Fixed a bug where the image used during the project FLIP animation would note be replaced with the higher resolution image\nafter the animation in certain browsers.\n  The drawer is now less likely to be opened by accident.\n\n\nv6.6.1\nAug 10 2017\n\n\n  Fixed sending incorrect paths to Google Analytics.\nIn previous versions, Hydejack would always send the URL of the initial page for all subsequent page views.\nThanks @dannydwarren for pointing this out.\n  Fixed tagline not showing up in the title.\n\n\nv6.6.0\nAug 7 2017\n\n\n  Dependencies from external domains have been removed\n(with the exception of those that are explicitly defined and optional: Google Analytics, Google Fonts and Disqus).\nInstead, they are now located in the assets folder and managed via Bower.\n  KaTeX is no longer loaded on pages that do not contain math blocks.\n  preload link tags no longer use onload. Instead callbacks are registered within a script tag.\n  \n    Code in code blocks is no longer smaller sized than inline code.\nTo undo this change, open (or create) _sass/my-inline.scss and add the following:\n\n    pre code { font-size: .75em; }\n    \n  \n  Added _includes/my-head.html, to make it easier to add things to the &lt;head/&gt; without modifying the source.\nThis is especially useful when using the gem-based version of the theme.\n\n\nv6.5.0\nJul 27 2017\n\nThis maintenance release includes various quality-of-life improvements when using the gem-based version of the theme.\n\nAdded\n\n  \n    Hydejack now uses additional Jekyll plugins by default, which make working with GitHub more convenient.\nThey have been added to the Gemfile and _config.yml.\nNote that existing users need to update their _config.yml:\n\n    gems:\n  - jekyll-default-layout # new\n  - jekyll-feed\n  - jekyll-optional-front-matter # new\n  - jekyll-paginate\n  - jekyll-redirect-from\n  - jekyll-relative-links # new\n  - jekyll-sitemap\n    \n  \n  Added licenses folder that includes the full license texts of licenses mentioned in NOTICE.md.\n  \n    You can, once again, define the author in _config.yml.\nUsing _data/authors.yml is still recommended (and takes precedence),\nbut this option is more convenient when setting up a quick (project-) page using the gem-based theme.\nAlso, a mini-version of _data/social.yml can be provided as part _config.yml, e.g.:\n\n    author:\n  social:\n    github: https://github.com/hydecorp/hydejack\n    npm: https://www.npmjs.com/package/hydejack\n    download: https://github.com/hydecorp/hydejack/archive/v6.5.0.zip\n\ndata_social:\n  github:\n    name: GitHub\n    icon: icon-github\n  npm:\n    name: npm\n    icon: icon-npm\n  download:\n    name: Download\n    icon: icon-box-add\n    \n  \n  A download icon has been added to the default icon font and _data/social.yml has been updated.\n  Added _includes/my-scripts.html, _sass/my-inline.scss and _sass/my-style.scss to make it easier to add custom scripts and styles without modifying the source. This is especially handy when using the gem-based version of the theme.\n\n\nChanged\n\n  Loading web fonts now starts earlier and content download no longer blocks\nswapping out the fallback font for the new font.\nPreviously, a page containing lots of images could have delayed displaying the web fonts significantly.\n  The home layout no longer contains a message suggesting that you don’t use it.\n  The home layout now shows up to 5 blog posts and up to 5 pages blow the regular content.\n  The version history has been moved from docs/&lt;version&gt;/versions.md to CHANGELOG.md.\n  The license notices have been moved from docs/&lt;version&gt;/licenses.md to NOTICE.md.\n  Updated gem and npm dependencies\n\n\nDesign\n\n  The default font has been changed from “Noto Serif” to “Noto Sans”.\nIf you have a font entry in _config.yml, this will have no effect.\n  nap.jpg is no longer used as default background image in the gem-based theme.\n  The sidebar content width is now limited to the width of the sidebar (this only effects large screens).\n  Project cards and pagination buttons now have slightly rounded borders for a less “rigid” look.\n\n\nHow to restore the old styles\nIf you would like to use the old font, add the following to _config.yml:\n\nfont_heading: \"'Roboto Slab', Helvetica, Arial, sans-serif\"\nfont:         \"'Noto Serif', Georgia, serif\"\ngoogle_fonts: \"Roboto+Slab:700|Noto+Serif:400,400i,700,700i\"\n\n\nIf you were relying on the default setting for the background image, add the following to _config.yml:\n\nimage: /hydejack/assets/img/nap.jpg\n\n\nNote that you have to replace /hydejack with your baseurl.\n\nTo restore the old sidebar, open (or create) _sass/my-inline.scss and add the following:\n\n@media screen { .sidebar-sticky { left: 2rem; max-width: none; } }\n\n\nTo remove the border radius, open (or create) _sass/my-inline.scss and add the following:\n\n.card, .pagination-item { border-radius: 0!important; }\n\n\nv6.4.1\nJun 23 2017\n\n\n  Fix invalid color hex\n\n\nv6.4.0\nJun 21 2017\n\nIn this release I’ve added a “Other Projects” section to the bottom of each project page,\nmaking it easier for users to navigate through your collection and discover other projects.\nAlso, it’s now possible to display larger (data-) tables that were previously cut off (especially on mobile devices).\n\nFor more on how to add tables, see the new section in docs/writing.\n\nSmaller changes include a reduced usage of horizontal lines and a more “semantic” use of hr elements.\nSpecifically, the semantics of the resume layout have been improved.\n\nMinor\n\n  Added “Other Projects” section to the bottom of the project layout (similar to “Related Posts”)\n  Added CSS classes that make viewing larger (data-) tables possible\n  Added section on tables to docs/writing\n  Reduced use of &lt;hr/&gt; elements, using CSS borders instead.\n  Improved semantic HTML of resume\n  Follow favicon best practices and include example icons\n  Added no_google_fonts option\n\n\nDesign\n\n  Reduced number of horizontal lines, making many layouts feel less “cluttered” (esp. blog layout)\n  Made link hover styles consistent across the board\n  Visually separated thead and tbody and tfoot within tables.\n  Changed RSS and email icons\n  Removed top margin for consecutive headings, e.g. when using h3 immediately after h2.\n\n\nFixes\n\n  Fixed bug that caused inline math to be moved to the end of a paragraph when dynamically loading a page.\n  Fixed bug that caused layout to break in IE11.\n  Fixed bug that caused the project animation to “jump” when using long project titles.\n  No more empty attributes on img tags.\n\n\nv6.3.0\nJun 6 2017\n\nThis release makes including third party plugins easier.\nUntil now, the push state approach to loading new pages has been interfering with embedded script tags.\nThis version changes this by simulating the sequential loading of script tags on a fresh page load.\n\nThis approach should work in a majority of cases, but can still cause problems with scripts that can’t be added more than once per page.\nIf an issue can’t be resolved, there’s now the option to disable push state by setting disable_push_state: true in config.yml.\n\nMinor\n\n  Support embedding script tags in markdown content\n  Add disable_push_state option to _config.yml\n  Add disable_drawer option to _config.yml\n  Rename syntax highlighting file to syntax.scss\n  Added chapter on third party scripts to documentation\n\n\nDesign\n\n  Add subtle intro animation\n  Rename “Check out X for more” to “See X for more” on welcome* page\n  Replace “»” with “→” in “read more”-type of links\n\n\nFixes\n\n  Fix default color in gem-based theme\n\n\nv6.2.0\nMay 29 2017\n\n\n  Changed default color and image\n  Updated demo content\n  Finalized welcome and project page\n  Color is now fading correctly when no background image is provided\n  Added exemplary usage of excerpt separator\n  Removed social media links from welcome and about page\n  Updated dependencies\n\n\nv6.1.1\nMay 23 2017\n\n\n  Add support for lang in front matter and _config.yml.\n  Add support for keywords in front matter and _config.yml.\n\n\nv6.1.0\nMay 15 2017\n\n\n  Updated JS dependencies\n  Added version history and licenses to documentation\n  Fixed print layout\n\n\nv6.0.0 (JavaScripten)\nMay 3 2017\n\nHydejack has always featured a JavaScript-heavy sidebar, but other than that, JS has been used sparingly. This changes with this release, which adds a ton of (optional) code that changes the feel of the theme dramatically.\n\nMajor\nPages are now loaded and swapped through JavaScript. This has a number of effects. First of all, it looks cool, but the animations aren’t just about aesthetics: They also help to hide the network time of fetching the next page, making the entire site feel faster. At the same time, the FOUC introduced in the last release will no longer occur (except on the initial page load).\n\n\n  Most JS is now unified in the _js directory and written in ES2016.\n  The blog-by-tag layout has been renamed to list.\n  public folder has been renamed to assets to make the theme compatible with Jekyll’s gem-based themes.\n  Tags are now supported via Jekyll Collections instead of _data.\n  The sidebar can now add links to all kinds of pages.\n  Categories are now supported.\n  Author information moved to _data/authors.yml\n  Added support for multiple authors.\n  Using jekyll-feed plugin (supported on GitHub Pages) instead of custom solution.\n  Added about layout.\n  Added not-found layout.\n  Added redirect layout\n\n\nSee the the migration guide for instructions on how to upgrade.\n\nMinor\n\n  The “accent” font (heading font) is now used for all headings. This gives the theme a “bolder” look and was necessary for the animation: link =&gt; heading.\n  Changed default text font from “PT Serif” to “Noto Serif”.\n  Added CSS classes for styling markdown content.\n  Links have a new style. They now always display an underline to make the choice of the link color less critical (darker colors were hard to distinguish from regular text).\n  Made social media icons larger and easier to tap.\n  Social media icons are now also part of the “about” sections of a post.\n  Added support for a copyright notice at the bottom. Can be set via the config variable copyright.\n  Changed responsive breakpoints and added support for very large displays.\n  The site is now printable.\n  The blog layout now only shows the excerpt instead of the full post.\n  Links to external pages are now marked with a symbol.\n  Added margin above social media icons to prevent accidental tapping\n  Added gem files so that bundle install and bundle exec jekyll serve work\n  Disabled HTML minification when running via jekyll serve\n  Added dingbat to signal end of post\n\n\nFixes\n\n  Related posts is no longer blank for posts that do not belong to a category.\n  Footnotes now use the text version of “leftwards arrow with hook” instead of the emoji on iOS.\n  Text is no longer invisible while waiting for Google Fonts to load.\n  Always show scrollbar to prevent layout “jumps”\n\n\nv5.3.0\nOct 1 2016\n\na11y improvements\n\n  Use HTML5 semantics tags + roles\n  Don’t set maximum-scale=1\n  Fix bug with sr-only class\n\n\nMath support improvements\n\n  LaTeX syntax errors will no longer prevent correct math blocks from being rendered\n  LaTeX syntax errors logged to console\n\n\nv5.2.0\nSep 29 2016\n\nPrevent structural FOUC\n\nv5.1.0\nSep 28 2016\n\nCross-browser compatibility improvements:\n\n  Added features tests\n  Fixed layout in IE 10 and 11\n  Disabled stylesheets and JS in IE 9 and below.\n\n\nv5.0.0 (The Fast One)\nSep 16 2016\n\nThis major release increases page load speed dramatically. The page now scores roughly 90/100 on Google’s PageSpeed Insights (up from ~50) and has a high score on similar tools.\n\nMost importantly, the critical rendering path is no longer blocked by loading styles or scripts, meaning the site becomes visible faster.\n\nPage load speed matters to Google, but is also very apparent to visitors with slow internet connections.\n\nHowever, as a side effect of these optimizations, the site now has a visible FOUC.\nFuture versions might address this, but it is the currency in which loading speed is being payed for and can not be fully avoided.\n\nMajor\n\n  HTML, CSS and JS served minified.\n  JS downloading starts only after the rest of the page is renderd.\n  Critical CSS (above-the-fold) is inlined into the document, the rest is fetched later.\n\n\nIn order to minify the CSS and make it more modular it has been rewritten in SCSS.\n\nMinor\n\n  Colored focus outline in page color\n  Tabindex for tab navigation\n  Social media icons easier tappable with finger\n\n\nTrivia\nNot strictly part of the release, but the images have been blurred to increase text readability and help with loading speed as well (burred images get compressed by JPG much better).\n\nv4.0.1\nSep 11 2016\n\nFix per-page color and image\n\nv4.0.0 (Social Media Impocalypse)\nAug 30 2016\n\nBreaking\n\n  Structure of _config.yml has changed\n    \n      Social media usernames are now located under author: social: &lt;platform&gt;: &lt;username&gt;.\n      disqus is now a top-level entry (moved from author).\n      Now has font, font_accent and google_fonts fields that are mandatory.\n    \n  \n  Now defaults to the blog layout, old style is available via blog-by-tag layout, see archive.html.\n\n\nNew features\n\n  Added a lot of social media icons, configurable via _config.yml.\n  New blog layout. Classic, paginated.\n  Fonts are configurable via _config.yml.\n\n\nDesign\n\n  Link underlines are now fixed-sized for all font sizes (no thicker lines for headlines, etc)\n\n\nFixes\n\n  Correctly set the meta description field using either the description field or post.excerpt as a fallback (used to contain the unmodified markdown).\n  Fixed various URL bugs relating to site.baseurl.\n\n\nInternal\n\n  Refactoring, preventing code duplications, heavier usage of includes.\n\n\nv3.0.0 (Hydejack)\nMay 7 2016\n\nHydejack is a pretentious two-column Jekyll theme, stolen by @qwtel from Hyde. You could say it was.. hydejacked.\n\nFeatures\nUnlike Hyde, it’s very opinionated about how you are going to use it.\n\nFeatures include:\n\n  Touch-enabled sidebar / drawer for mobile, including fallback when JS is disabled.\n  Github Pages compatible tag support based on this post.\n  Customizable link color and sidebar image, per-site, per-tag and per-post.\n  Optional author section at the bottom of each post.\n  Optional comment section powered by Disqus.\n  Layout for posts grouped by year\n  Wide array of social media icons on sidebar.\n  Math blocks via KaTeX.\n\n\nv2.0.0 (Hyde)\nJan 2 2014\n\nv1.0.0 (Hyde)\nOct 15 2013\n\n",
      "url": "/CHANGELOG/"
    },{
      
      "title": "NOTICE",
      
      "content": "NOTICE\n\n\n  NOTICE    \n      Attributions\n      Licenses        \n          Hyde\n          hy-drawer\n          hy-push-state\n          RxJS\n          KaTeX\n          core-js\n          Web Animations\n          Modernizr\n          Compress HTML in Jekyll\n          The HTML5 Shiv\n          DOM4\n          loadCSS\n          Ratchet\n          Swipe\n          smoothState\n          Bootstrap\n          Atom One Light Syntax\n          Atom One Dark Syntax\n          MiniSearch\n          window.fetch polyfill\n          AbortController polyfill for abortable fetch()\n          ResizeObserver Polyfill\n          kv-storage polyfill\n          IntersectionObserver polyfill\n          Web Components Polyfills\n          lit-html\n        \n      \n    \n  \n\n\nCopyright (c) 2020 Florian Klampfer https://qwtel.com/\n\nThis program is free software: you can redistribute it and/or modify\nit under the terms of the GNU General Public License as published by\nthe Free Software Foundation, either version 3 of the License, or\n(at your option) any later version.\n\nThis program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with this program.  If not, see http://www.gnu.org/licenses/.\n\nAttributions\nAppropriate credit as per Creative Commons licenses.\n\n\n  \n    \n      Work\n      License\n      Changes\n    \n  \n  \n    \n      Photo by Jeremy Bishop\n      Unsplash\n      Liquify filter, blur\n    \n    \n      Photo by Caleb George\n      Unsplash\n      Liquify filter, patch tool, blur\n    \n    \n      IcoMoon Icons Free Version by Keyamoon\n      CC-BY-SA-4.0\n      None\n    \n    \n      Touch-161562.svg\n      CC0-1.0\n      Composition\n    \n  \n\n\nLicenses\nParts of this software are provided under separate licenses.\n\nHyde\nThis software also uses portions of the\npoole/hyde\nproject, which is MIT licensed with the following copyright:\n\n\n  Copyright (c) 2013 Mark Otto.\n\n\nhy-drawer\nThis software also uses portions of the\nhydecorp/hy-drawer\nproject, which is GPL-3.0 licensed with the following copyright:\n\n\n  Copyright (c) 2018 Florian Klampfer https://qwtel.com/\n\n\nhy-push-state\nThis software also uses portions of the\nhydecorp/hy-push-state\nproject, which is GPL-3.0 licensed with the following copyright:\n\n\n  Copyright (c) 2018 Florian Klampfer https://qwtel.com/\n\n\nRxJS\nThis software also uses portions of the\nReactiveX/rxjs\nproject, which is Apache-2.0 licensed with the following copyright:\n\n\n  Copyright (c) 2015-2017 Google, Inc., Netflix, Inc., Microsoft Corp. and contributors\n\n\nNo substantial changes to the software were made.\nNo NOTICE file was provided.\n\nKaTeX\nThis software also uses portions of the\nKhan/KaTeX\nproject, which is MIT licensed with the following copyright:\n\n\n  Copyright (c) 2015 Khan Academy\n\n\ncore-js\nThis software also uses portions of the\nzloirock/core-js\nproject, which is MIT licensed with the following copyright:\n\n\n  Copyright (c) 2014-2016 Denis Pushkarev\n\n\nWeb Animations\nThis software also uses portions of the\nweb-animations/web-animations-js\nproject, which is Apache-2.0 licensed with the following copyright:\n\n\n  Copyright 2014 Google Inc. All rights reserved.\n\n\nNo substantial changes to the software were made.\nNo NOTICE file was provided.\n\nModernizr\nThis software also uses portions of the\nModernizr/Modernizr\nproject, which is MIT licensed with the following copyright:\n\n\n  Copyright (c)\n Faruk Ates\n Paul Irish\n Alex Sexton\n Ryan Seddon\n Patrick Kettner\n Stu Cox\n Richard Herrera\n\n\nCompress HTML in Jekyll\nThis software also uses portions of the\npenibelst/jekyll-compress-html\nproject, which is MIT licensed with the following copyright:\n\n\n  Copyright (c) 2014 Anatol Broder\n\n\nThe HTML5 Shiv\nThis software also uses portions of the\naFarkas/html5shiv\nproject, which is MIT licensed with the following copyright:\n\n\n  Copyright (c) 2014 Alexander Farkas (aFarkas).\n\n\nDOM4\nThis software also uses portions of the\nWebReflection/dom4\nproject, which is MIT licensed with the following copyright:\n\n\n  Copyright (C) 2013-2015 by Andrea Giammarchi - @WebReflection\n\n\nloadCSS\nThis software also uses portions of the\nfilamentgroup/loadCSS\nproject, which is MIT licensed with the following copyright:\n\n\n  Copyright (c) @scottjehl, 2016 Filament Group\n\n\nRatchet\nThis software also uses portions of the\ntwbs/ratchet\nproject, which is MIT licensed with the following copyright:\n\n\n  Copyright (c) 2015 connors and other contributors\n\n\nSwipe\nThis software also uses portions of the\nthebird/Swipe\nproject, which is MIT licensed with the following copyright:\n\n\n  Copyright (c) 2013 Brad Birdsall\n\n\nsmoothState\nThis software also uses portions of the\nmiguel-perez/smoothState.js\nproject, which is MIT licensed with the following copyright:\n\n\n  Copyright (c) 2014 Miguel Angel Perez\n\n\nBootstrap\nThis software also uses portions of the\ntwbs/bootstrap\nproject, which is MIT licensed with the following copyright:\n\n\n  Copyright (c) 2011-2018 Twitter, Inc.\nCopyright (c) 2011-2018 The Bootstrap Authors\n\n\nAtom One Light Syntax\nThis software also uses portions of the\natom/one-light-syntax\nproject, which is MIT licensed with the following copyright:\n\n\n  Copyright (c) 2016 GitHub Inc.\n\n\nAtom One Dark Syntax\nThis software also uses portions of the\natom/one-dark-syntax\nproject, which is MIT licensed with the following copyright:\n\n\n  Copyright (c) 2016 GitHub Inc.\n\n\nMiniSearch\nThis software also uses portions of the\nlucaong/minisearch\nproject, which is MIT licensed with the following copyright:\n\n\n  Copyright 2018 Luca Ongaro\n\n\nwindow.fetch polyfill\nThis software also uses portions of the\ngithub/fetch\nproject, which is MIT licensed with the following copyright:\n\n\n  Copyright (c) 2014-2016 GitHub, Inc.\n\n\nAbortController polyfill for abortable fetch()\nThis software also uses portions of the\nmo/abortcontroller-polyfill\nproject, which is MIT licensed with the following copyright:\n\n\n  Copyright (c) 2017 molsson\n\n\nResizeObserver Polyfill\nThis software also uses portions of the\njuggle/resize-observer\nproject, which is Apache-2.0 licensed with the following copyright:\n\n\n  Copyright 2019 JUGGLE LTD\n\n\nkv-storage polyfill\nThis software also uses portions of the\nGoogleChromeLabs/kv-storage-polyfill\nproject, which is Apache-2.0 licensed with the following copyright:\n\n\n  Copyright 2019 Google Inc.\n\n\nIntersectionObserver polyfill\nThis software also uses portions of the\nw3c/IntersectionObserver\nproject, which is W3C-20150513 licensed with the following copyright:\n\n\n  Copyright 2016 Google Inc. All Rights Reserved.\n\n\nNo substantial changes to the software were made.\n\nWeb Components Polyfills\nThis software also uses portions of the\nwebcomponents/webcomponentsjs\nproject, which is BSD-style licensed with the following copyright:\n\n\n  Copyright (c) 2019 The Polymer Authors. All rights reserved.\n\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n\n  Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n  Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n  Neither the name of Google Inc. nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS “AS IS” AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nlit-html\nThis software also uses portions of the\nPolymer/lit-html\nproject, which is BSD-style licensed with the following copyright:\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n\n  Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n  Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n  Neither the name of Google Inc. nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS “AS IS” AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n",
      "url": "/NOTICE/"
    },{
      
      "title": "CV",
      
      "content": "CV (latex version): pdf .tex\n\nCV (R Markdown using latex): pdf .Rmd template-latex\n\nTo use the R Markdown version using latex, the ‘cv-latex.tex’ file should be saved in the same directory from which the Rmd file is run.\n",
      "url": "/cv/"
    },{
      
      "title": "Forms by Example",
      "description": "Hydejack PRO allows you to build your own forms, using the same CSS classes as Bootstrap. Below you can find examples to help you get started.\n",
      "content": "Example 1\n\n  \n    Email address\n    \n    We'll never share your email with anyone else.\n  \n  \n    Password\n    \n  \n  \n    \n      \n      Check me out\n    \n  \n  Submit\n\n\n&lt;form&gt;\n  &lt;div class=\"form-group\"&gt;\n    &lt;label for=\"exampleInputEmail1\"&gt;Email address&lt;/label&gt;\n    &lt;input type=\"email\" class=\"form-control\" id=\"exampleInputEmail1\" aria-describedby=\"emailHelp\" placeholder=\"Enter email\"&gt;\n    &lt;small id=\"emailHelp\" class=\"form-text text-muted\"&gt;We'll never share your email with anyone else.&lt;/small&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-group\"&gt;\n    &lt;label for=\"exampleInputPassword1\"&gt;Password&lt;/label&gt;\n    &lt;input type=\"password\" class=\"form-control\" id=\"exampleInputPassword1\" placeholder=\"Password\"&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-check\"&gt;\n    &lt;label class=\"form-check-label\"&gt;\n      &lt;input type=\"checkbox\" class=\"form-check-input\"&gt;\n      Check me out\n    &lt;/label&gt;\n  &lt;/div&gt;\n  &lt;button type=\"submit\" class=\"btn btn-primary\"&gt;Submit&lt;/button&gt;\n&lt;/form&gt;\n\n\nExample 2\n\n  \n    Email address\n    \n  \n  \n    Example select\n    \n      1\n      2\n      3\n      4\n      5\n    \n  \n  \n    Example multiple select\n    \n      1\n      2\n      3\n      4\n      5\n    \n  \n  \n    Example textarea\n    \n  \n\n\n&lt;form&gt;\n  &lt;div class=\"form-group\"&gt;\n    &lt;label for=\"exampleFormControlInput1\"&gt;Email address&lt;/label&gt;\n    &lt;input type=\"email\" class=\"form-control\" id=\"exampleFormControlInput1\" placeholder=\"name@example.com\"&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-group\"&gt;\n    &lt;label for=\"exampleFormControlSelect1\"&gt;Example select&lt;/label&gt;\n    &lt;select class=\"form-control\" id=\"exampleFormControlSelect1\"&gt;\n      &lt;option&gt;1&lt;/option&gt;\n      &lt;option&gt;2&lt;/option&gt;\n      &lt;option&gt;3&lt;/option&gt;\n      &lt;option&gt;4&lt;/option&gt;\n      &lt;option&gt;5&lt;/option&gt;\n    &lt;/select&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-group\"&gt;\n    &lt;label for=\"exampleFormControlSelect2\"&gt;Example multiple select&lt;/label&gt;\n    &lt;select multiple class=\"form-control\" id=\"exampleFormControlSelect2\"&gt;\n      &lt;option&gt;1&lt;/option&gt;\n      &lt;option&gt;2&lt;/option&gt;\n      &lt;option&gt;3&lt;/option&gt;\n      &lt;option&gt;4&lt;/option&gt;\n      &lt;option&gt;5&lt;/option&gt;\n    &lt;/select&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-group\"&gt;\n    &lt;label for=\"exampleFormControlTextarea1\"&gt;Example textarea&lt;/label&gt;\n    &lt;textarea class=\"form-control\" id=\"exampleFormControlTextarea1\" rows=\"3\"&gt;&lt;/textarea&gt;\n  &lt;/div&gt;\n&lt;/form&gt;\n\n\nExample 3\n\n  \n    Example file input\n    \n  \n\n\n&lt;form&gt;\n  &lt;div class=\"form-group\"&gt;\n    &lt;label for=\"exampleFormControlFile1\"&gt;Example file input&lt;/label&gt;\n    &lt;input type=\"file\" class=\"form-control-file\" id=\"exampleFormControlFile1\"&gt;\n  &lt;/div&gt;\n&lt;/form&gt;\n\n\nExample 4\n\n  \n    \n  \n  \n    \n  \n  \n    \n  \n  \n    \n      Large select\n    \n  \n  \n    \n      Default select\n    \n  \n  \n    \n      Small select\n    \n  \n  \n    \n  \n\n\n&lt;form&gt;\n  &lt;div class=\"form-group\"&gt;\n    &lt;input class=\"form-control form-control-lg\" type=\"text\" placeholder=\".form-control-lg\"&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-group\"&gt;\n    &lt;input class=\"form-control\" type=\"text\" placeholder=\"Default input\"&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-group\"&gt;\n    &lt;input class=\"form-control form-control-sm\" type=\"text\" placeholder=\".form-control-sm\"&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-group\"&gt;\n    &lt;select class=\"form-control form-control-lg\"&gt;\n      &lt;option&gt;Large select&lt;/option&gt;\n    &lt;/select&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-group\"&gt;\n    &lt;select class=\"form-control\"&gt;\n      &lt;option&gt;Default select&lt;/option&gt;\n    &lt;/select&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-group\"&gt;\n    &lt;select class=\"form-control form-control-sm\"&gt;\n      &lt;option&gt;Small select&lt;/option&gt;\n    &lt;/select&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-group\"&gt;\n    &lt;input class=\"form-control\" type=\"text\" placeholder=\"Readonly input here…\" readonly&gt;\n  &lt;/div&gt;\n&lt;/form&gt;\n\n\nExample 5\n\n  \n    Email\n    \n      \n    \n  \n  \n    Password\n    \n      \n    \n  \n\n\n&lt;form&gt;\n  &lt;div class=\"form-group row\"&gt;\n    &lt;label for=\"staticEmail\" class=\"col-sm-2 col-form-label\"&gt;Email&lt;/label&gt;\n    &lt;div class=\"col-sm-10\"&gt;\n      &lt;input type=\"text\" readonly class=\"form-control-plaintext\" id=\"staticEmail\" value=\"email@example.com\"&gt;\n    &lt;/div&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-group row\"&gt;\n    &lt;label for=\"inputPassword\" class=\"col-sm-2 col-form-label\"&gt;Password&lt;/label&gt;\n    &lt;div class=\"col-sm-10\"&gt;\n      &lt;input type=\"password\" class=\"form-control\" id=\"inputPassword\" placeholder=\"Password\"&gt;\n    &lt;/div&gt;\n  &lt;/div&gt;\n&lt;/form&gt;\n\n\nExample 6\n\n  \n    Email\n    \n  \n  \n    Password\n    \n  \n  Confirm identity\n\n\n&lt;form class=\"form-inline\"&gt;\n  &lt;div class=\"form-group\"&gt;\n    &lt;label for=\"staticEmail2\" class=\"sr-only\"&gt;Email&lt;/label&gt;\n    &lt;input type=\"text\" readonly class=\"form-control-plaintext\" id=\"staticEmail2\" value=\"email@example.com\"&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-group mx-sm-3\"&gt;\n    &lt;label for=\"inputPassword2\" class=\"sr-only\"&gt;Password&lt;/label&gt;\n    &lt;input type=\"password\" class=\"form-control\" id=\"inputPassword2\" placeholder=\"Password\"&gt;\n  &lt;/div&gt;\n  &lt;button type=\"submit\" class=\"btn btn-primary\"&gt;Confirm identity&lt;/button&gt;\n&lt;/form&gt;\n\n\nExample 7\n\n  \n    \n      \n      Option one is this and that&mdash;be sure to include why it's great\n    \n  \n  \n    \n      \n      Option two is disabled\n    \n  \n\n\n&lt;form&gt;\n  &lt;div class=\"form-check\"&gt;\n    &lt;label class=\"form-check-label\"&gt;\n      &lt;input class=\"form-check-input\" type=\"checkbox\" value=\"\"&gt;\n      Option one is this and that&amp;mdash;be sure to include why it's great\n    &lt;/label&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-check disabled\"&gt;\n    &lt;label class=\"form-check-label\"&gt;\n      &lt;input class=\"form-check-input\" type=\"checkbox\" value=\"\" disabled&gt;\n      Option two is disabled\n    &lt;/label&gt;\n  &lt;/div&gt;\n&lt;/form&gt;\n\n\nExample 8\n\n  \n    \n      \n      Option one is this and that&mdash;be sure to include why it's great\n    \n  \n  \n    \n      \n      Option two can be something else and selecting it will deselect option one\n    \n  \n  \n    \n      \n      Option three is disabled\n    \n  \n\n\n&lt;form&gt;\n  &lt;div class=\"form-check\"&gt;\n    &lt;label class=\"form-check-label\"&gt;\n      &lt;input class=\"form-check-input\" type=\"radio\" name=\"exampleRadios\" id=\"exampleRadios1\" value=\"option1\" checked&gt;\n      Option one is this and that&amp;mdash;be sure to include why it's great\n    &lt;/label&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-check\"&gt;\n    &lt;label class=\"form-check-label\"&gt;\n      &lt;input class=\"form-check-input\" type=\"radio\" name=\"exampleRadios\" id=\"exampleRadios2\" value=\"option2\"&gt;\n      Option two can be something else and selecting it will deselect option one\n    &lt;/label&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-check disabled\"&gt;\n    &lt;label class=\"form-check-label\"&gt;\n      &lt;input class=\"form-check-input\" type=\"radio\" name=\"exampleRadios\" id=\"exampleRadios3\" value=\"option3\" disabled&gt;\n      Option three is disabled\n    &lt;/label&gt;\n  &lt;/div&gt;\n&lt;/form&gt;\n\n\nExample 9\n\n  \n    \n       1\n    \n  \n  \n    \n       2\n    \n  \n  \n    \n       3\n    \n  \n\n\n&lt;form&gt;\n  &lt;div class=\"form-check form-check-inline\"&gt;\n    &lt;label class=\"form-check-label\"&gt;\n      &lt;input class=\"form-check-input\" type=\"checkbox\" id=\"inlineCheckbox1\" value=\"option1\"&gt; 1\n    &lt;/label&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-check form-check-inline\"&gt;\n    &lt;label class=\"form-check-label\"&gt;\n      &lt;input class=\"form-check-input\" type=\"checkbox\" id=\"inlineCheckbox2\" value=\"option2\"&gt; 2\n    &lt;/label&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-check form-check-inline disabled\"&gt;\n    &lt;label class=\"form-check-label\"&gt;\n      &lt;input class=\"form-check-input\" type=\"checkbox\" id=\"inlineCheckbox3\" value=\"option3\" disabled&gt; 3\n    &lt;/label&gt;\n  &lt;/div&gt;\n&lt;/form&gt;\n\n\nExample 10\n\n  \n    \n       1\n    \n  \n  \n    \n       2\n    \n  \n  \n    \n       3\n    \n  \n\n\n&lt;form&gt;\n  &lt;div class=\"form-check form-check-inline\"&gt;\n    &lt;label class=\"form-check-label\"&gt;\n      &lt;input class=\"form-check-input\" type=\"radio\" name=\"inlineRadioOptions\" id=\"inlineRadio1\" value=\"option1\"&gt; 1\n    &lt;/label&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-check form-check-inline\"&gt;\n    &lt;label class=\"form-check-label\"&gt;\n      &lt;input class=\"form-check-input\" type=\"radio\" name=\"inlineRadioOptions\" id=\"inlineRadio2\" value=\"option2\"&gt; 2\n    &lt;/label&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-check form-check-inline disabled\"&gt;\n    &lt;label class=\"form-check-label\"&gt;\n      &lt;input class=\"form-check-input\" type=\"radio\" name=\"inlineRadioOptions\" id=\"inlineRadio3\" value=\"option3\" disabled&gt; 3\n    &lt;/label&gt;\n  &lt;/div&gt;\n&lt;/form&gt;\n\n\nExample 11\n\n  \n    Example label\n    \n  \n  \n    Another label\n    \n  \n\n\n&lt;form&gt;\n  &lt;div class=\"form-group\"&gt;\n    &lt;label class=\"form-control-label\" for=\"formGroupExampleInput\"&gt;Example label&lt;/label&gt;\n    &lt;input type=\"text\" class=\"form-control\" id=\"formGroupExampleInput\" placeholder=\"Example input\"&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-group\"&gt;\n    &lt;label class=\"form-control-label\" for=\"formGroupExampleInput2\"&gt;Another label&lt;/label&gt;\n    &lt;input type=\"text\" class=\"form-control\" id=\"formGroupExampleInput2\" placeholder=\"Another input\"&gt;\n  &lt;/div&gt;\n&lt;/form&gt;\n\n\nExample 12\n\n  \n    \n      \n    \n    \n      \n    \n  \n\n\n&lt;form&gt;\n  &lt;div class=\"form-row\"&gt;\n    &lt;div class=\"col\"&gt;\n      &lt;input type=\"text\" class=\"form-control\" placeholder=\"First name\"&gt;\n    &lt;/div&gt;\n    &lt;div class=\"col\"&gt;\n      &lt;input type=\"text\" class=\"form-control\" placeholder=\"Last name\"&gt;\n    &lt;/div&gt;\n  &lt;/div&gt;\n&lt;/form&gt;\n\n\nExample 13\n\n  \n    \n      Email\n      \n    \n    \n      Password\n      \n    \n  \n  \n    Address\n    \n  \n  \n    Address 2\n    \n  \n  \n    \n      City\n      \n    \n    \n      State\n      Choose\n    \n    \n      Zip\n      \n    \n  \n  \n    \n      \n         Check me out\n      \n    \n  \n  Sign in\n\n\n&lt;form&gt;\n  &lt;div class=\"form-row\"&gt;\n    &lt;div class=\"form-group col-md-6\"&gt;\n      &lt;label for=\"inputEmail4\" class=\"col-form-label\"&gt;Email&lt;/label&gt;\n      &lt;input type=\"email\" class=\"form-control\" id=\"inputEmail4\" placeholder=\"Email\"&gt;\n    &lt;/div&gt;\n    &lt;div class=\"form-group col-md-6\"&gt;\n      &lt;label for=\"inputPassword4\" class=\"col-form-label\"&gt;Password&lt;/label&gt;\n      &lt;input type=\"password\" class=\"form-control\" id=\"inputPassword4\" placeholder=\"Password\"&gt;\n    &lt;/div&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-group\"&gt;\n    &lt;label for=\"inputAddress\" class=\"col-form-label\"&gt;Address&lt;/label&gt;\n    &lt;input type=\"text\" class=\"form-control\" id=\"inputAddress\" placeholder=\"1234 Main St\"&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-group\"&gt;\n    &lt;label for=\"inputAddress2\" class=\"col-form-label\"&gt;Address 2&lt;/label&gt;\n    &lt;input type=\"text\" class=\"form-control\" id=\"inputAddress2\" placeholder=\"Apartment, studio, or floor\"&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-row\"&gt;\n    &lt;div class=\"form-group col-md-6\"&gt;\n      &lt;label for=\"inputCity\" class=\"col-form-label\"&gt;City&lt;/label&gt;\n      &lt;input type=\"text\" class=\"form-control\" id=\"inputCity\"&gt;\n    &lt;/div&gt;\n    &lt;div class=\"form-group col-md-4\"&gt;\n      &lt;label for=\"inputState\" class=\"col-form-label\"&gt;State&lt;/label&gt;\n      &lt;select id=\"inputState\" class=\"form-control\"&gt;Choose&lt;/select&gt;\n    &lt;/div&gt;\n    &lt;div class=\"form-group col-md-2\"&gt;\n      &lt;label for=\"inputZip\" class=\"col-form-label\"&gt;Zip&lt;/label&gt;\n      &lt;input type=\"text\" class=\"form-control\" id=\"inputZip\"&gt;\n    &lt;/div&gt;\n  &lt;/div&gt;\n  &lt;div class=\"form-group\"&gt;\n    &lt;div class=\"form-check\"&gt;\n      &lt;label class=\"form-check-label\"&gt;\n        &lt;input class=\"form-check-input\" type=\"checkbox\"&gt; Check me out\n      &lt;/label&gt;\n    &lt;/div&gt;\n  &lt;/div&gt;\n  &lt;button type=\"submit\" class=\"btn btn-primary\"&gt;Sign in&lt;/button&gt;\n&lt;/form&gt;\n\n\nExample 14\n\n  \n    \n      \n    \n    \n      \n    \n    \n      \n    \n  \n\n\n&lt;form&gt;\n  &lt;div class=\"form-row\"&gt;\n    &lt;div class=\"col-7\"&gt;\n      &lt;input type=\"text\" class=\"form-control\" placeholder=\"City\"&gt;\n    &lt;/div&gt;\n    &lt;div class=\"col\"&gt;\n      &lt;input type=\"text\" class=\"form-control\" placeholder=\"State\"&gt;\n    &lt;/div&gt;\n    &lt;div class=\"col\"&gt;\n      &lt;input type=\"text\" class=\"form-control\" placeholder=\"Zip\"&gt;\n    &lt;/div&gt;\n  &lt;/div&gt;\n&lt;/form&gt;\n\n\nExample 15\n\n  \n    \n      Name\n      \n    \n    \n      Username\n      \n        @\n        \n      \n    \n    \n      \n        \n           Remember me\n        \n      \n    \n    \n      Submit\n    \n  \n\n\n&lt;form&gt;\n  &lt;div class=\"form-row align-items-center\"&gt;\n    &lt;div class=\"col-auto\"&gt;\n      &lt;label class=\"sr-only\" for=\"inlineFormInput\"&gt;Name&lt;/label&gt;\n      &lt;input type=\"text\" class=\"form-control mb-2 mb-sm-0\" id=\"inlineFormInput\" placeholder=\"Jane Doe\"&gt;\n    &lt;/div&gt;\n    &lt;div class=\"col-auto\"&gt;\n      &lt;label class=\"sr-only\" for=\"inlineFormInputGroup\"&gt;Username&lt;/label&gt;\n      &lt;div class=\"input-group mb-2 mb-sm-0\"&gt;\n        &lt;div class=\"input-group-prepend\"&gt;&lt;div class=\"input-group-text\"&gt;@&lt;/div&gt;&lt;/div&gt;\n        &lt;input type=\"text\" class=\"form-control\" id=\"inlineFormInputGroup\" placeholder=\"Username\"&gt;\n      &lt;/div&gt;\n    &lt;/div&gt;\n    &lt;div class=\"col-auto\"&gt;\n      &lt;div class=\"form-check mb-2 mb-sm-0\"&gt;\n        &lt;label class=\"form-check-label\"&gt;\n          &lt;input class=\"form-check-input\" type=\"checkbox\"&gt; Remember me\n        &lt;/label&gt;\n      &lt;/div&gt;\n    &lt;/div&gt;\n    &lt;div class=\"col-auto\"&gt;\n      &lt;button type=\"submit\" class=\"btn btn-primary\"&gt;Submit&lt;/button&gt;\n    &lt;/div&gt;\n  &lt;/div&gt;\n&lt;/form&gt;\n\n\nExample 16\n\n  \n    \n      Name\n      \n    \n    \n      Username\n      \n        @\n        \n      \n    \n    \n      \n        \n           Remember me\n        \n      \n    \n    \n      Submit\n    \n  \n\n\n&lt;form&gt;\n  &lt;div class=\"form-row align-items-center\"&gt;\n    &lt;div class=\"col-sm-3\"&gt;\n      &lt;label class=\"sr-only\" for=\"inlineFormInputName\"&gt;Name&lt;/label&gt;\n      &lt;input type=\"text\" class=\"form-control mb-2 mb-sm-0\" id=\"inlineFormInputName\" placeholder=\"Jane Doe\"&gt;\n    &lt;/div&gt;\n    &lt;div class=\"col-sm-3\"&gt;\n      &lt;label class=\"sr-only\" for=\"inlineFormInputGroupUsername\"&gt;Username&lt;/label&gt;\n      &lt;div class=\"input-group mb-2 mb-sm-0\"&gt;\n        &lt;div class=\"input-group-prepend\"&gt;&lt;div class=\"input-group-text\"&gt;@&lt;/div&gt;&lt;/div&gt;\n        &lt;input type=\"text\" class=\"form-control\" id=\"inlineFormInputGroupUsername\" placeholder=\"Username\"&gt;\n      &lt;/div&gt;\n    &lt;/div&gt;\n    &lt;div class=\"col-auto\"&gt;\n      &lt;div class=\"form-check mb-2 mb-sm-0\"&gt;\n        &lt;label class=\"form-check-label\"&gt;\n          &lt;input class=\"form-check-input\" type=\"checkbox\"&gt; Remember me\n        &lt;/label&gt;\n      &lt;/div&gt;\n    &lt;/div&gt;\n    &lt;div class=\"col-auto\"&gt;\n      &lt;button type=\"submit\" class=\"btn btn-primary\"&gt;Submit&lt;/button&gt;\n    &lt;/div&gt;\n  &lt;/div&gt;\n&lt;/form&gt;\n\n\nExample 17\n\n  Name\n  \n\n  Username\n  \n    @\n    \n  \n\n  \n    \n       Remember me\n    \n  \n\n  Submit\n\n\n&lt;form class=\"form-inline\"&gt;\n  &lt;label class=\"sr-only\" for=\"inlineFormInputName2\"&gt;Name&lt;/label&gt;\n  &lt;input type=\"text\" class=\"form-control mb-2 mr-sm-2 mb-sm-0\" id=\"inlineFormInputName2\" placeholder=\"Jane Doe\"&gt;\n\n  &lt;label class=\"sr-only\" for=\"inlineFormInputGroupUsername2\"&gt;Username&lt;/label&gt;\n  &lt;div class=\"input-group mb-2 mr-sm-2 mb-sm-0\"&gt;\n    &lt;div class=\"input-group-prepend\"&gt;&lt;div class=\"input-group-text\"&gt;@&lt;/div&gt;&lt;/div&gt;\n    &lt;input type=\"text\" class=\"form-control\" id=\"inlineFormInputGroupUsername2\" placeholder=\"Username\"&gt;\n  &lt;/div&gt;\n\n  &lt;div class=\"form-check mb-2 mr-sm-2 mb-sm-0\"&gt;\n    &lt;label class=\"form-check-label\"&gt;\n      &lt;input class=\"form-check-input\" type=\"checkbox\"&gt; Remember me\n    &lt;/label&gt;\n  &lt;/div&gt;\n\n  &lt;button type=\"submit\" class=\"btn btn-primary\"&gt;Submit&lt;/button&gt;\n&lt;/form&gt;\n\n\nExample 18\n\n  \n    Password\n    \n    \n      Must be 8-20 characters long.\n    \n  \n\n\n&lt;form class=\"form-inline\"&gt;\n  &lt;div class=\"form-group\"&gt;\n    &lt;label for=\"inputPassword6\"&gt;Password&lt;/label&gt;\n    &lt;input type=\"password\" id=\"inputPassword6\" class=\"form-control mx-sm-3\" aria-describedby=\"passwordHelpInline\"&gt;\n    &lt;small id=\"passwordHelpInline\" class=\"text-muted\"&gt;\n      Must be 8-20 characters long.\n    &lt;/small&gt;\n  &lt;/div&gt;\n&lt;/form&gt;\n\n\nExample 19\n\n  \n    \n      Disabled input\n      \n    \n    \n      Disabled select menu\n      \n        Disabled select\n      \n    \n    \n      \n         Can't check this\n      \n    \n    Submit\n  \n\n\n&lt;form&gt;\n  &lt;fieldset disabled&gt;\n    &lt;div class=\"form-group\"&gt;\n      &lt;label for=\"disabledTextInput\"&gt;Disabled input&lt;/label&gt;\n      &lt;input type=\"text\" id=\"disabledTextInput\" class=\"form-control\" placeholder=\"Disabled input\"&gt;\n    &lt;/div&gt;\n    &lt;div class=\"form-group\"&gt;\n      &lt;label for=\"disabledSelect\"&gt;Disabled select menu&lt;/label&gt;\n      &lt;select id=\"disabledSelect\" class=\"form-control\"&gt;\n        &lt;option&gt;Disabled select&lt;/option&gt;\n      &lt;/select&gt;\n    &lt;/div&gt;\n    &lt;div class=\"checkbox\"&gt;\n      &lt;label&gt;\n        &lt;input type=\"checkbox\"&gt; Can't check this\n      &lt;/label&gt;\n    &lt;/div&gt;\n    &lt;button type=\"submit\" class=\"btn btn-primary\"&gt;Submit&lt;/button&gt;\n  &lt;/fieldset&gt;\n&lt;/form&gt;\n\n",
      "url": "/forms-by-example/"
    },{
      
      "title": "Blog",
      "description": "The official Hydejack blog. Version updates, example content and how-to guides on how to blog with Jekyll.\n",
      "content": "\n",
      "url": "/blog/"
    },{
      
      "title": "AndrewBenito",
      
      "content": "Andrew Benito Chief European Economist at a London-based, macro hedge fund. Previously, Managing Director at Goldman Sachs (8 years), Research Manager at Bank of England (12 years, including secondments to the International Monetary Fund and Banco de España) and Research Fellow at the University of Warwick. My work has been cited extensively by policy-makers and the media and been published in academic journals. I am also a Research Fellow at IZA, Institute of Labor Economics.\n",
      "url": "/"
    },{
      
      
      
      "content": "\n",
      "url": "/offline.html"
    },{
      
      "title": "Posts",
      "description": "This is the list layout for showing blog posts, which shows just the title and groups them by year of publication. Check out the blog layout for comparison.\n",
      "content": "\n",
      "url": "/posts/"
    },{
      
      "title": "Projects",
      
      "content": "\n",
      "url": "/projects/"
    },{
      
      "title": "Research",
      
      "content": "Housing markets\n\n\n  \n    Benito, A and Mumtaz, H (2009), ‘Excess sensitivity, liquidity constraints and the collateral role of housing’, Macroeconomic Dynamics, 13, 305-326\n  \n  \n    Benito, A (2009), ‘Who withdraws housing equity and why?’, Economica, 76, 51-70\n  \n  \n    Benito, A (2007), ‘The down-payment constraint and UK housing market: Does the theory fit the facts?’, Journal of Housing Economics, 15, 1-20\n  \n  \n    Benito, A (2007), ‘What risks do housing markets pose for global growth?’,\nIMF World Economic Outlook.\n  \n  \n    Benito, A (2007), ‘Housing market slowdowns’, IMF World Economic Outlook\n  \n  \n    Benito, A et al (2006), ‘House prices and consumer spending’, Bank of England Quarterly Bulletin\n  \n  \n    Benito, A. and Wood, R., (2005), ‘How important is housing market\nactivity for durables spending?’, Bank of England Quarterly Bulletin\n  \n  \n    Benito, A. and Power, J. (2004), ‘Housing equity and consumption: insights from the Survey of English Housing’, Bank of England Quarterly Bulletin\n  \n\n\nLabour markets\n\n\n  \n    Benito, A. and Young, G. (2021), ‘The UK productivity shortfall in an era of rising labour supply’, IZA Discussion Paper 14620.\n  \n  \n    Benito, A. (2017), ‘How does monetary policy affect labor demand and labor productivity?’, IZA World of Labor.\n  \n  \n    Benito, A. and Bunn, P. (2011), ‘Understanding labour force participation in the UK’, Bank of England Quarterly Bulletin\n  \n  \n    Benito, A and Hernando, I (2008), ‘Labour demand, flexible contracts and financial factors’, Oxford Bulletin of Economics and Statistics, 70, 283-301\n  \n  \n    Benito, A (2000), ‘Inter-industry wage differentials in Great Britain’, Oxford Bulletin of Economics and Statistics, 62, 727-746.\n  \n\n\nCompany behaviour\n\n\n  \n    Benito, A and Young, G (2007), ‘Financial pressure and balance sheet adjustment by firms’, Oxford Bulletin of Economics and Statistics, 69, 581-602.\n  \n  \n    Benito, A and Young, G (2003), ‘Hard Times or Great Expectations? Dividend omissions and dividend cuts by UK firms’, Oxford Bulletin of Economics and Statistics, 65, 531-57\n  \n  \n    Benito, A and Hernando, I (2007), ‘Financial pressure and firm beha- viour: Evidence from Spanish panel data’, Bulletin of Economic Research, 59, 283-311\n  \n  \n    Benito, A (2005), ‘Financial pressure, monetary policy effects and inventories: Firm-level evidence from a market-based and a bank-based financial system’, Economica, 72, 201-224\n  \n  \n    Benito, A. et al (2010), ‘The effect of the financial crisis on supply’, Bank of England Quarterly Bulletin\n  \n  \n    Benito, A., et al (2001), ‘Analysing corporate and household sector balance sheets’, Bank of England Financial Stability Review\n  \n  \n    Benito, A. and Vlieghe, G. (2000), ‘Stylised facts on UK corporate financial health: Evidence from micro-data’, Bank of England Financial Stability Review\n  \n\n\nFamily behaviour\n\n\n  \n    Benito, A and Saleheen, J (2013), ‘Labour supply as a buffer: Evidence from UK households’, Economica 80, 698-720\n  \n  \n    Benito, A (2006), ‘Does job insecurity affect household consumption?’, Oxford Economic Papers, 56, 157-81\n  \n  \n    Benito, A., et al (2007),‘The role of household debt and balance sheets in the monetary transmission mechanism’, Bank of England Quarterly Bulletin\n  \n\n\nGoogle Scholar\n",
      "url": "/research/"
    },{
      
      "title": "Résumé*",
      "description": "This is the description of your resume page, as it will be seen by search engines. You’ll probably want to modify it in resume.md, and maybe set hide_description to true in the front matter.\n",
      "content": "\n",
      "url": "/resume/"
    },{
      
      "title": "Teaching",
      
      "content": "How to teach\n\nTalks\n\n\n  \n    Central bank communications, financial markets and a little data science\n  \n  \n    The UK productivity shortfall in an era of rising labour supply based on this paper with Garry Young.\n  \n  \n    A talk on Brexit, given to Harvard Business School MBA Class (Nov.2020).\n  \n  \n    A talk on working as an Economist in Finance, given to Warwick University Finance Society  (Oct. 2019).\n  \n\n\n",
      "url": "/teaching/"
    },{
      
      "title": "Apache License",
      
      "content": "Apache License\n\nVersion 2.0, January 2004\n\nhttp://www.apache.org/licenses/\n\nTERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n1. Definitions\n\n“License” shall mean the terms and conditions for use, reproduction,\nand distribution as defined by Sections 1 through 9 of this document.\n\n“Licensor” shall mean the copyright owner or entity authorized by\nthe copyright owner that is granting the License.\n\n“Legal Entity” shall mean the union of the acting entity and all\nother entities that control, are controlled by, or are under common\ncontrol with that entity. For the purposes of this definition,\n“control” means (i) the power, direct or indirect, to cause the\ndirection or management of such entity, whether by contract or\notherwise, or (ii) ownership of fifty percent (50%) or more of the\noutstanding shares, or (iii) beneficial ownership of such entity.\n\n“You” (or “Your”) shall mean an individual or Legal Entity\nexercising permissions granted by this License.\n\n“Source” form shall mean the preferred form for making modifications,\nincluding but not limited to software source code, documentation\nsource, and configuration files.\n\n“Object” form shall mean any form resulting from mechanical\ntransformation or translation of a Source form, including but\nnot limited to compiled object code, generated documentation,\nand conversions to other media types.\n\n“Work” shall mean the work of authorship, whether in Source or\nObject form, made available under the License, as indicated by a\ncopyright notice that is included in or attached to the work\n(an example is provided in the Appendix below).\n\n“Derivative Works” shall mean any work, whether in Source or Object\nform, that is based on (or derived from) the Work and for which the\neditorial revisions, annotations, elaborations, or other modifications\nrepresent, as a whole, an original work of authorship. For the purposes\nof this License, Derivative Works shall not include works that remain\nseparable from, or merely link (or bind by name) to the interfaces of,\nthe Work and Derivative Works thereof.\n\n“Contribution” shall mean any work of authorship, including\nthe original version of the Work and any modifications or additions\nto that Work or Derivative Works thereof, that is intentionally\nsubmitted to Licensor for inclusion in the Work by the copyright owner\nor by an individual or Legal Entity authorized to submit on behalf of\nthe copyright owner. For the purposes of this definition, “submitted”\nmeans any form of electronic, verbal, or written communication sent\nto the Licensor or its representatives, including but not limited to\ncommunication on electronic mailing lists, source code control systems,\nand issue tracking systems that are managed by, or on behalf of, the\nLicensor for the purpose of discussing and improving the Work, but\nexcluding communication that is conspicuously marked or otherwise\ndesignated in writing by the copyright owner as “Not a Contribution.”\n\n“Contributor” shall mean Licensor and any individual or Legal Entity\non behalf of whom a Contribution has been received by Licensor and\nsubsequently incorporated within the Work.\n\n2. Grant of Copyright License\nSubject to the terms and conditions of\nthis License, each Contributor hereby grants to You a perpetual,\nworldwide, non-exclusive, no-charge, royalty-free, irrevocable\ncopyright license to reproduce, prepare Derivative Works of,\npublicly display, publicly perform, sublicense, and distribute the\nWork and such Derivative Works in Source or Object form.\n\n3. Grant of Patent License\nSubject to the terms and conditions of\nthis License, each Contributor hereby grants to You a perpetual,\nworldwide, non-exclusive, no-charge, royalty-free, irrevocable\n(except as stated in this section) patent license to make, have made,\nuse, offer to sell, sell, import, and otherwise transfer the Work,\nwhere such license applies only to those patent claims licensable\nby such Contributor that are necessarily infringed by their\nContribution(s) alone or by combination of their Contribution(s)\nwith the Work to which such Contribution(s) was submitted. If You\ninstitute patent litigation against any entity (including a\ncross-claim or counterclaim in a lawsuit) alleging that the Work\nor a Contribution incorporated within the Work constitutes direct\nor contributory patent infringement, then any patent licenses\ngranted to You under this License for that Work shall terminate\nas of the date such litigation is filed.\n\n4. Redistribution\nYou may reproduce and distribute copies of the\nWork or Derivative Works thereof in any medium, with or without\nmodifications, and in Source or Object form, provided that You\nmeet the following conditions:\n\n\n  \n    You must give any other recipients of the Work or\nDerivative Works a copy of this License; and\n  \n  \n    You must cause any modified files to carry prominent notices\nstating that You changed the files; and\n  \n  \n    You must retain, in the Source form of any Derivative Works\nthat You distribute, all copyright, patent, trademark, and\nattribution notices from the Source form of the Work,\nexcluding those notices that do not pertain to any part of\nthe Derivative Works; and\n  \n  \n    If the Work includes a “NOTICE” text file as part of its\ndistribution, then any Derivative Works that You distribute must\ninclude a readable copy of the attribution notices contained\nwithin such NOTICE file, excluding those notices that do not\npertain to any part of the Derivative Works, in at least one\nof the following places: within a NOTICE text file distributed\nas part of the Derivative Works; within the Source form or\ndocumentation, if provided along with the Derivative Works; or,\nwithin a display generated by the Derivative Works, if and\nwherever such third-party notices normally appear. The contents\nof the NOTICE file are for informational purposes only and\ndo not modify the License. You may add Your own attribution\nnotices within Derivative Works that You distribute, alongside\nor as an addendum to the NOTICE text from the Work, provided\nthat such additional attribution notices cannot be construed\nas modifying the License.\n\n    You may add Your own copyright statement to Your modifications and\nmay provide additional or different license terms and conditions\nfor use, reproduction, or distribution of Your modifications, or\nfor any such Derivative Works as a whole, provided Your use,\nreproduction, and distribution of the Work otherwise complies with\nthe conditions stated in this License.\n  \n\n\n5. Submission of Contributions\nUnless You explicitly state otherwise,\nany Contribution intentionally submitted for inclusion in the Work\nby You to the Licensor shall be under the terms and conditions of\nthis License, without any additional terms or conditions.\nNotwithstanding the above, nothing herein shall supersede or modify\nthe terms of any separate license agreement you may have executed\nwith Licensor regarding such Contributions.\n\n6. Trademarks\nThis License does not grant permission to use the trade\nnames, trademarks, service marks, or product names of the Licensor,\nexcept as required for reasonable and customary use in describing the\norigin of the Work and reproducing the content of the NOTICE file.\n\n7. Disclaimer of Warranty\nUnless required by applicable law or\nagreed to in writing, Licensor provides the Work (and each\nContributor provides its Contributions) on an “AS IS” BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\nimplied, including, without limitation, any warranties or conditions\nof TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\nPARTICULAR PURPOSE. You are solely responsible for determining the\nappropriateness of using or redistributing the Work and assume any\nrisks associated with Your exercise of permissions under this License.\n\n8. Limitation of Liability\nIn no event and under no legal theory,\nwhether in tort (including negligence), contract, or otherwise,\nunless required by applicable law (such as deliberate and grossly\nnegligent acts) or agreed to in writing, shall any Contributor be\nliable to You for damages, including any direct, indirect, special,\nincidental, or consequential damages of any character arising as a\nresult of this License or out of the use or inability to use the\nWork (including but not limited to damages for loss of goodwill,\nwork stoppage, computer failure or malfunction, or any and all\nother commercial damages or losses), even if such Contributor\nhas been advised of the possibility of such damages.\n\n9. Accepting Warranty or Additional Liability\nWhile redistributing\nthe Work or Derivative Works thereof, You may choose to offer,\nand charge a fee for, acceptance of support, warranty, indemnity,\nor other liability obligations and/or rights consistent with this\nLicense. However, in accepting such obligations, You may act only\non Your own behalf and on Your sole responsibility, not on behalf\nof any other Contributor, and only if You agree to indemnify,\ndefend, and hold each Contributor harmless for any liability\n\nEND OF TERMS AND CONDITIONS\n\nAPPENDIX: How to apply the Apache License to your work\n\nTo apply the Apache License to your work, attach the following boilerplate\nnotice, with the fields enclosed by brackets [] replaced with your own\nidentifying information. (Don’t include the brackets!) The text should be\nenclosed in the appropriate comment syntax for the file format. We also\nrecommend that a file or class name and description of purpose be included on\nthe same “printed page” as the copyright notice for easier identification within\nthird-party archives.\n\nCopyright [yyyy] [name of copyright owner]\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n\n",
      "url": "/licenses/Apache-2.0/"
    },{
      
      "title": "GNU GENERAL PUBLIC LICENSE",
      
      "content": "GNU GENERAL PUBLIC LICENSE\n\nVersion 3, 29 June 2007\n\nCopyright (C) 2007 Free Software Foundation, Inc.\nhttp://fsf.org/\n\nEveryone is permitted to copy and distribute verbatim copies of this\nlicense document, but changing it is not allowed.\n\nPreamble\n\nThe GNU General Public License is a free, copyleft license for\nsoftware and other kinds of works.\n\nThe licenses for most software and other practical works are designed\nto take away your freedom to share and change the works. By contrast,\nthe GNU General Public License is intended to guarantee your freedom\nto share and change all versions of a program–to make sure it remains\nfree software for all its users. We, the Free Software Foundation, use\nthe GNU General Public License for most of our software; it applies\nalso to any other work released this way by its authors. You can apply\nit to your programs, too.\n\nWhen we speak of free software, we are referring to freedom, not\nprice. Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\nTo protect your rights, we need to prevent others from denying you\nthese rights or asking you to surrender the rights. Therefore, you\nhave certain responsibilities if you distribute copies of the\nsoftware, or if you modify it: responsibilities to respect the freedom\nof others.\n\nFor example, if you distribute copies of such a program, whether\ngratis or for a fee, you must pass on to the recipients the same\nfreedoms that you received. You must make sure that they, too, receive\nor can get the source code. And you must show them these terms so they\nknow their rights.\n\nDevelopers that use the GNU GPL protect your rights with two steps:\n(1) assert copyright on the software, and (2) offer you this License\ngiving you legal permission to copy, distribute and/or modify it.\n\nFor the developers’ and authors’ protection, the GPL clearly explains\nthat there is no warranty for this free software. For both users’ and\nauthors’ sake, the GPL requires that modified versions be marked as\nchanged, so that their problems will not be attributed erroneously to\nauthors of previous versions.\n\nSome devices are designed to deny users access to install or run\nmodified versions of the software inside them, although the\nmanufacturer can do so. This is fundamentally incompatible with the\naim of protecting users’ freedom to change the software. The\nsystematic pattern of such abuse occurs in the area of products for\nindividuals to use, which is precisely where it is most unacceptable.\nTherefore, we have designed this version of the GPL to prohibit the\npractice for those products. If such problems arise substantially in\nother domains, we stand ready to extend this provision to those\ndomains in future versions of the GPL, as needed to protect the\nfreedom of users.\n\nFinally, every program is threatened constantly by software patents.\nStates should not allow patents to restrict development and use of\nsoftware on general-purpose computers, but in those that do, we wish\nto avoid the special danger that patents applied to a free program\ncould make it effectively proprietary. To prevent this, the GPL\nassures that patents cannot be used to render the program non-free.\n\nThe precise terms and conditions for copying, distribution and\nmodification follow.\n\nTERMS AND CONDITIONS\n\n0. Definitions\n\n“This License” refers to version 3 of the GNU General Public License.\n\n“Copyright” also means copyright-like laws that apply to other kinds\nof works, such as semiconductor masks.\n\n“The Program” refers to any copyrightable work licensed under this\nLicense. Each licensee is addressed as “you”. “Licensees” and\n“recipients” may be individuals or organizations.\n\nTo “modify” a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of\nan exact copy. The resulting work is called a “modified version” of\nthe earlier work or a work “based on” the earlier work.\n\nA “covered work” means either the unmodified Program or a work based\non the Program.\n\nTo “propagate” a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy. Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\nTo “convey” a work means any kind of propagation that enables other\nparties to make or receive copies. Mere interaction with a user\nthrough a computer network, with no transfer of a copy, is not\nconveying.\n\nAn interactive user interface displays “Appropriate Legal Notices” to\nthe extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License. If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n1. Source Code\n\nThe “source code” for a work means the preferred form of the work for\nmaking modifications to it. “Object code” means any non-source form of\na work.\n\nA “Standard Interface” means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\nThe “System Libraries” of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form. A\n“Major Component”, in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\nThe “Corresponding Source” for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities. However, it does not include the work’s\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work. For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\nThe Corresponding Source need not include anything that users can\nregenerate automatically from other parts of the Corresponding Source.\n\nThe Corresponding Source for a work in source code form is that same\nwork.\n\n2. Basic Permissions\n\nAll rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met. This License explicitly affirms your unlimited\npermission to run the unmodified Program. The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work. This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\nYou may make, run and propagate covered works that you do not convey,\nwithout conditions so long as your license otherwise remains in force.\nYou may convey covered works to others for the sole purpose of having\nthem make modifications exclusively for you, or provide you with\nfacilities for running those works, provided that you comply with the\nterms of this License in conveying all material for which you do not\ncontrol copyright. Those thus making or running the covered works for\nyou must do so exclusively on your behalf, under your direction and\ncontrol, on terms that prohibit them from making any copies of your\ncopyrighted material outside their relationship with you.\n\nConveying under any other circumstances is permitted solely under the\nconditions stated below. Sublicensing is not allowed; section 10 makes\nit unnecessary.\n\n3. Protecting Users’ Legal Rights From Anti-Circumvention Law\n\nNo covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\nWhen you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such\ncircumvention is effected by exercising rights under this License with\nrespect to the covered work, and you disclaim any intention to limit\noperation or modification of the work as a means of enforcing, against\nthe work’s users, your or third parties’ legal rights to forbid\ncircumvention of technological measures.\n\n4. Conveying Verbatim Copies\n\nYou may convey verbatim copies of the Program’s source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\nYou may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n5. Conveying Modified Source Versions\n\nYou may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these\nconditions:\n\n\n  The work must carry prominent notices stating that you modified\nit, and giving a relevant date.\n  The work must carry prominent notices stating that it is\nreleased under this License and any conditions added under\nsection 7. This requirement modifies the requirement in section 4\nto “keep intact all notices”.\n  You must license the entire work, as a whole, under this\nLicense to anyone who comes into possession of a copy. This\nLicense will therefore apply, along with any applicable section 7\nadditional terms, to the whole of the work, and all its parts,\nregardless of how they are packaged. This License gives no\npermission to license the work in any other way, but it does not\ninvalidate such permission if you have separately received it.\n  If the work has interactive user interfaces, each must display\nAppropriate Legal Notices; however, if the Program has interactive\ninterfaces that do not display Appropriate Legal Notices, your\nwork need not make them do so.\n\n\nA compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n“aggregate” if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation’s users\nbeyond what the individual works permit. Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n6. Conveying Non-Source Forms\n\nYou may convey a covered work in object code form under the terms of\nsections 4 and 5, provided that you also convey the machine-readable\nCorresponding Source under the terms of this License, in one of these\nways:\n\n\n  Convey the object code in, or embodied in, a physical product\n(including a physical distribution medium), accompanied by the\nCorresponding Source fixed on a durable physical medium\ncustomarily used for software interchange.\n  Convey the object code in, or embodied in, a physical product\n(including a physical distribution medium), accompanied by a\nwritten offer, valid for at least three years and valid for as\nlong as you offer spare parts or customer support for that product\nmodel, to give anyone who possesses the object code either (1) a\ncopy of the Corresponding Source for all the software in the\nproduct that is covered by this License, on a durable physical\nmedium customarily used for software interchange, for a price no\nmore than your reasonable cost of physically performing this\nconveying of source, or (2) access to copy the Corresponding\nSource from a network server at no charge.\n  Convey individual copies of the object code with a copy of the\nwritten offer to provide the Corresponding Source. This\nalternative is allowed only occasionally and noncommercially, and\nonly if you received the object code with such an offer, in accord\nwith subsection 6b.\n  Convey the object code by offering access from a designated\nplace (gratis or for a charge), and offer equivalent access to the\nCorresponding Source in the same way through the same place at no\nfurther charge. You need not require recipients to copy the\nCorresponding Source along with the object code. If the place to\ncopy the object code is a network server, the Corresponding Source\nmay be on a different server (operated by you or a third party)\nthat supports equivalent copying facilities, provided you maintain\nclear directions next to the object code saying where to find the\nCorresponding Source. Regardless of what server hosts the\nCorresponding Source, you remain obligated to ensure that it is\navailable for as long as needed to satisfy these requirements.\n  Convey the object code using peer-to-peer transmission,\nprovided you inform other peers where the object code and\nCorresponding Source of the work are being offered to the general\npublic at no charge under subsection 6d.\n\n\nA separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\nA “User Product” is either (1) a “consumer product”, which means any\ntangible personal property which is normally used for personal,\nfamily, or household purposes, or (2) anything designed or sold for\nincorporation into a dwelling. In determining whether a product is a\nconsumer product, doubtful cases shall be resolved in favor of\ncoverage. For a particular product received by a particular user,\n“normally used” refers to a typical or common use of that class of\nproduct, regardless of the status of the particular user or of the way\nin which the particular user actually uses, or expects or is expected\nto use, the product. A product is a consumer product regardless of\nwhether the product has substantial commercial, industrial or\nnon-consumer uses, unless such uses represent the only significant\nmode of use of the product.\n\n“Installation Information” for a User Product means any methods,\nprocedures, authorization keys, or other information required to\ninstall and execute modified versions of a covered work in that User\nProduct from a modified version of its Corresponding Source. The\ninformation must suffice to ensure that the continued functioning of\nthe modified object code is in no case prevented or interfered with\nsolely because modification has been made.\n\nIf you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information. But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\nThe requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or\nupdates for a work that has been modified or installed by the\nrecipient, or for the User Product in which it has been modified or\ninstalled. Access to a network may be denied when the modification\nitself materially and adversely affects the operation of the network\nor violates the rules and protocols for communication across the\nnetwork.\n\nCorresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n7. Additional Terms\n\n“Additional permissions” are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law. If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\nWhen you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit. (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.) You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\nNotwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders\nof that material) supplement the terms of this License with terms:\n\n\n  Disclaiming warranty or limiting liability differently from the\nterms of sections 15 and 16 of this License; or\n  Requiring preservation of specified reasonable legal notices or\nauthor attributions in that material or in the Appropriate Legal\nNotices displayed by works containing it; or\n  Prohibiting misrepresentation of the origin of that material,\nor requiring that modified versions of such material be marked in\nreasonable ways as different from the original version; or\n  Limiting the use for publicity purposes of names of licensors\nor authors of the material; or\n  Declining to grant rights under trademark law for use of some\ntrade names, trademarks, or service marks; or\n  Requiring indemnification of licensors and authors of that\nmaterial by anyone who conveys the material (or modified versions\nof it) with contractual assumptions of liability to the recipient,\nfor any liability that these contractual assumptions directly\nimpose on those licensors and authors.\n\n\nAll other non-permissive additional terms are considered “further\nrestrictions” within the meaning of section 10. If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term. If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\nIf you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\nAdditional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions; the\nabove requirements apply either way.\n\n8. Termination\n\nYou may not propagate or modify a covered work except as expressly\nprovided under this License. Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\nHowever, if you cease all violation of this License, then your license\nfrom a particular copyright holder is reinstated (a) provisionally,\nunless and until the copyright holder explicitly and finally\nterminates your license, and (b) permanently, if the copyright holder\nfails to notify you of the violation by some reasonable means prior to\n60 days after the cessation.\n\nMoreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\nTermination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License. If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n9. Acceptance Not Required for Having Copies\n\nYou are not required to accept this License in order to receive or run\na copy of the Program. Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance. However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work. These actions infringe copyright if you do\nnot accept this License. Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n10. Automatic Licensing of Downstream Recipients\n\nEach time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License. You are not responsible\nfor enforcing compliance by third parties with this License.\n\nAn “entity transaction” is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations. If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party’s predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\nYou may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License. For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n11. Patents\n\nA “contributor” is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based. The\nwork thus licensed is called the contributor’s “contributor version”.\n\nA contributor’s “essential patent claims” are all patent claims owned\nor controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version. For\npurposes of this definition, “control” includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\nEach contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor’s essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\nIn the following three paragraphs, a “patent license” is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement). To “grant” such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\nIf you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients. “Knowingly relying” means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient’s use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\nIf, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\nA patent license is “discriminatory” if it does not include within the\nscope of its coverage, prohibits the exercise of, or is conditioned on\nthe non-exercise of one or more of the rights that are specifically\ngranted under this License. You may not convey a covered work if you\nare a party to an arrangement with a third party that is in the\nbusiness of distributing software, under which you make payment to the\nthird party based on the extent of your activity of conveying the\nwork, and under which the third party grants, to any of the parties\nwho would receive the covered work from you, a discriminatory patent\nlicense (a) in connection with copies of the covered work conveyed by\nyou (or copies made from those copies), or (b) primarily for and in\nconnection with specific products or compilations that contain the\ncovered work, unless you entered into that arrangement, or that patent\nlicense was granted, prior to 28 March 2007.\n\nNothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n12. No Surrender of Others’ Freedom\n\nIf conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License. If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under\nthis License and any other pertinent obligations, then as a\nconsequence you may not convey it at all. For example, if you agree to\nterms that obligate you to collect a royalty for further conveying\nfrom those to whom you convey the Program, the only way you could\nsatisfy both those terms and this License would be to refrain entirely\nfrom conveying the Program.\n\n13. Use with the GNU Affero General Public License\n\nNotwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU Affero General Public License into a single\ncombined work, and to convey the resulting work. The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the special requirements of the GNU Affero General Public License,\nsection 13, concerning interaction through a network will apply to the\ncombination as such.\n\n14. Revised Versions of this License\n\nThe Free Software Foundation may publish revised and/or new versions\nof the GNU General Public License from time to time. Such new versions\nwill be similar in spirit to the present version, but may differ in\ndetail to address new problems or concerns.\n\nEach version is given a distinguishing version number. If the Program\nspecifies that a certain numbered version of the GNU General Public\nLicense “or any later version” applies to it, you have the option of\nfollowing the terms and conditions either of that numbered version or\nof any later version published by the Free Software Foundation. If the\nProgram does not specify a version number of the GNU General Public\nLicense, you may choose any version ever published by the Free\nSoftware Foundation.\n\nIf the Program specifies that a proxy can decide which future versions\nof the GNU General Public License can be used, that proxy’s public\nstatement of acceptance of a version permanently authorizes you to\nchoose that version for the Program.\n\nLater license versions may give you additional or different\npermissions. However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n15. Disclaimer of Warranty\n\nTHERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW. EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM “AS IS” WITHOUT\nWARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY AND\nPERFORMANCE OF THE PROGRAM IS WITH YOU. SHOULD THE PROGRAM PROVE\nDEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR\nCORRECTION.\n\n16. Limitation of Liability\n\nIN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR\nCONVEYS THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES\nARISING OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT\nNOT LIMITED TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR\nLOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM\nTO OPERATE WITH ANY OTHER PROGRAMS), EVEN IF SUCH HOLDER OR OTHER\nPARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n17. Interpretation of Sections 15 and 16\n\nIf the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n",
      "url": "/licenses/GPL-3.0/"
    },{
      
      "title": "MIT License",
      
      "content": "MIT License\n\nCopyright (c) &lt;YEAR&gt; &lt;COPYRIGHT HOLDER&gt;\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the “Software”), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n",
      "url": "/licenses/MIT/"
    },{
      
      "title": "PRO License",
      
      "content": "PRO License\n\n\n  PRO License    \n      License Summary\n      Terms and Conditions        \n          1. Preamble\n          2. License Grant\n          3. Term &amp; Termination:\n          4. Payment\n          5. Upgrades, Updates and Fixes\n          6. Support\n          7. Liability\n          8. Warranty\n          9. No Refunds\n          10. Indemnification\n          11. Governing Law, Jurisdiction\n        \n      \n    \n  \n\n\nLicense Summary\n\n  License concerns use of Hydejack PRO\n  License does not expire\n  Commercial use allowed\n  Can modify source code\n  Parts of software are provided under separate licenses\n\n\nTerms and Conditions\n1. Preamble\nThis Agreement governs the relationship between you (hereinafter: Licensee) and\nFlorian Klampfer qwtel.com (hereinafter: Licensor).\nThis Agreement sets the terms, rights, restrictions and obligations on using\nHydejack PRO (hereinafter: The Software)\ncreated and owned by Licensor, as detailed herein.\n\n2. License Grant\nLicensor hereby grants Licensee a Personal, Perpetual, Commercial, Royalty free,\nIncluding the rights to create derivative works, Non-exclusive license, all with accordance with\nthe terms set forth and other legal restrictions set forth in 3rd party software used while running Software.\n\n\n  \n    Limited: Licensee may use Software for the purpose of:\n\n    \n      Running Software on Licensee’s Website[s] and Server[s];\n      Allowing 3rd Parties to run Software on Licensee’s Website[s] and Server[s];\n      Publishing Software’s output to Licensee and 3rd Parties;\n      Modify Software to suit Licensee’s needs and specifications.\n    \n  \n  \n    This license is granted perpetually, as long as you do not materially breach it.\n  \n  \n    Commercial, Royalty Free: Licensee may use Software for any purpose, including paid-services, without any\nroyalties\n  \n  \n    Including the Right to Create Derivative Works: Licensee may create derivative works based on Software,\nincluding amending Software’s source code, modifying it, integrating it into a larger work or removing portions of\nSoftware.\n  \n\n\n3. Term &amp; Termination:\nThe Term of this license shall be until terminated. Licensor may terminate this Agreement,\nincluding Licensee’s license in the case where Licensee:\n\n\n  became insolvent or otherwise entered into any liquidation process; or\n  exported The Software to any jurisdiction where licensor may not enforce his rights under this agreements in; or\n  Licensee was in breach of any of this license’s terms and conditions and such breach was not cured, immediately\nupon notification; or\n  Licensee in breach of any of the terms of clause 2 to this license; or\n  Licensee otherwise entered into any arrangement which caused Licensor to be unable to enforce his rights under\nthis License.\n\n\n4. Payment\nIn consideration of the License granted under clause 2, Licensee shall pay Licensor a fee, via\nCredit-Card or any other means which Licensor may deem adequate. Failure to perform payment shall construe as\nmaterial breach of this Agreement.\n\n5. Upgrades, Updates and Fixes\nLicensor may provide Licensee, from time to time, with Upgrades, Updates or Fixes,\nas detailed herein and according to his sole discretion. Licensee hereby warrants to keep The Software up-to-date\nand install all relevant updates and fixes, and may, at his sole discretion, purchase upgrades, according to the\nrates set by Licensor. Licensor shall provide any update or Fix free of charge; however, nothing in this Agreement\nshall require Licensor to provide Updates or Fixes.\n\n\n  \n    Upgrades: for the purpose of this license, an Upgrade shall be a material amendment in The Software, which\ncontains new features and or major performance improvements and shall be marked as a new version number. For\nexample, should Licensee purchase The Software under version 1.X.X, an upgrade shall commence under number\n2.0.0.\n  \n  \n    Updates: for the purpose of this license, an update shall be a minor amendment in The Software, which may\ncontain new features or minor improvements and shall be marked as a new sub-version number. For example, should\nLicensee purchase The Software under version 1.1.X, an upgrade shall commence under number 1.2.0.\n  \n  \n    Fix: for the purpose of this license, a fix shall be a minor amendment in The Software, intended to remove\nbugs or alter minor features which impair the The Software’s functionality. A fix shall be marked as a new\nsub-sub-version number. For example, should Licensee purchase Software under version 1.1.1, an upgrade shall\ncommence under number 1.1.2.\n  \n\n\n6. Support\nSoftware is provided under an AS-IS basis and without any support, updates or maintenance. Nothing in\nthis Agreement shall require Licensor to provide Licensee with support or fixes to any bug, failure,\nmis-performance or other defect in The Software.\n\n\n  \n    Bug Notification: Licensee may provide Licensor of details regarding any bug, defect or failure in The\nSoftware promptly and with no delay from such event; Licensee shall comply with Licensor’s request for\ninformation regarding bugs, defects or failures and furnish him with information, screenshots and try to\nreproduce such bugs, defects or failures.\n  \n  \n    Feature Request: Licensee may request additional features in Software, provided, however, that:\n\n    \n      Licensee shall waive any claim or right in such feature should feature be developed by Licensor;\n      Licensee shall be prohibited from developing the feature, or disclose such feature request, or feature, to\nany 3rd party directly competing with Licensor or any 3rd party which may be, following the development of\nsuch feature, in direct competition with Licensor;\n      Licensee warrants that feature does not infringe any 3rd party patent, trademark, trade-secret or any other\nintellectual property right; and\n      Licensee developed, envisioned or created the feature solely by himself.\n    \n  \n\n\n7. Liability\nTo the extent permitted under Law, The Software is provided under an AS-IS basis. Licensor shall\nnever, and without any limit, be liable for any damage, cost, expense or any other payment incurred by Licensee as\na result of Software’s actions, failure, bugs and/or any other interaction between The Software and Licensee’s\nend-equipment, computers, other software or any 3rd party, end-equipment, computer or services. Moreover, Licensor\nshall never be liable for any defect in source code written by Licensee when relying on The Software or using The\nSoftware’s source code.\n\n8. Warranty\n\n  \n    No-Warranty: The Software is provided without any warranty; Licensor hereby disclaims any warranty that The\nSoftware shall be error free, without defects or code which may cause damage to Licensee’s computers or to\nLicensee, and that Software shall be functional. Licensee shall be solely liable to any damage, defect or loss\nincurred as a result of operating software and undertake the risks contained in running The Software on\nLicense’s Server[s] and Website[s].\n  \n  \n    Prior Inspection: Licensee hereby states that he inspected The Software thoroughly and found it\nsatisfactory and adequate to his needs, that it does not interfere with his regular operation and that it does\nmeet the standards and scope of his computer systems and architecture. Licensee found that The Software\ninteracts with his development, website and server environment and that it does not infringe any of End User\nLicense Agreement of any software Licensee may use in performing his services. Licensee hereby waives any\nclaims regarding The Software’s incompatibility, performance, results and features, and warrants that he\ninspected the The Software.\n  \n\n\n9. No Refunds\nLicensee warrants that he inspected The Software according to clause 8.2 and that it is adequate to\nhis needs. Accordingly, as The Software is intangible goods, Licensee shall not be, ever, entitled to any refund,\nrebate, compensation or restitution for any reason whatsoever, even if The Software contains material flaws.\n\n10. Indemnification\nLicensee hereby warrants to hold Licensor harmless and indemnify Licensor for any lawsuit\nbrought against it in regards to Licensee’s use of The Software in means that violate, breach or otherwise\ncircumvent this license, Licensor’s intellectual property rights or Licensor’s title in The Software. Licensor\nshall promptly notify Licensee in case of such legal action and request Licensee’s consent prior to any settlement\nin relation to such lawsuit or claim.\n\n11. Governing Law, Jurisdiction\nLicensee hereby agrees not to initiate class-action lawsuits against Licensor in\nrelation to this license and to compensate Licensor for any legal fees, cost or attorney fees should any claim\nbrought by Licensee against Licensor be denied, in part or in full.\n\n",
      "url": "/licenses/PRO/"
    },{
      
      "title": "W3C SOFTWARE NOTICE AND LICENSE",
      
      "content": "W3C SOFTWARE NOTICE AND LICENSE\n\nStatus: This license takes effect 13 May, 2015.\n\nThis work is being provided by the copyright holders under the following license.\n\nLicense\n\nBy obtaining and/or copying this work, you (the licensee) agree that you have read, understood, and will comply with the following terms and conditions.\n\nPermission to copy, modify, and distribute this work, with or without modification, for any purpose and without fee or royalty is hereby granted, provided that you include the following on ALL copies of the work or portions thereof, including modifications:\n\n\n  The full text of this NOTICE in a location viewable to users of the redistributed or derivative work.\n  Any pre-existing intellectual property disclaimers, notices, or terms and conditions. If none exist, the W3C Software and Document Short Notice should be included.\n  Notice of any changes or modifications, through a copyright statement on the new code or document such as “This software or document includes material copied from or derived from [title and URI of the W3C document]. Copyright © [YEAR] W3C® (MIT, ERCIM, Keio, Beihang).”\n\n\nDisclaimers\n\nTHIS WORK IS PROVIDED “AS IS,” AND COPYRIGHT HOLDERS MAKE NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF THE SOFTWARE OR DOCUMENT WILL NOT INFRINGE ANY THIRD PARTY PATENTS, COPYRIGHTS, TRADEMARKS OR OTHER RIGHTS.\n\nCOPYRIGHT HOLDERS WILL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF ANY USE OF THE SOFTWARE OR DOCUMENT.\n\nThe name and trademarks of copyright holders may NOT be used in advertising or publicity pertaining to the work without specific, written prior permission. Title to copyright in this work will at all times remain with copyright holders.\n\nNotes\n\nThis version: http://www.w3.org/Consortium/Legal/2015/copyright-software-and-document\n\nPrevious version: http://www.w3.org/Consortium/Legal/2002/copyright-software-20021231\n\nThis version makes clear that the license is applicable to both software and text, by changing the name and substituting “work” for instances of “software and its documentation.” It moves “notice of changes or modifications to the files” to the copyright notice, to make clear that the license is compatible with other liberal licenses.\n",
      "url": "/licenses/W3C-20150513/"
    },{
      
      "title": "Licenses",
      
      "content": "Licenses\n\nOpen Source\n\n  Apache-2.0\n  GPL-3.0\n  MIT\n  W3C-20150513\n\n\nCustom\n\n  PRO\n\n",
      "url": "/licenses/"
    }
  ], 
  "documents": [
    {
      "image": {"path":"/assets/img/blog/euro2.jpg","srcset":{"1920w":"/assets/img/blog/euro2.jpg","960w":"/assets/img/blog/euro2.jpg","480w":"/assets/img/blog/euro2.jpg"}},
      "title": "The €A and Pygmalion",
      "date": "2020-06-10 00:00:00 +0100",
      
      "content": "A note on €A institutional reform. The note was written at the height of the €A sovereign and banking crisis in 2012, prior to Mr Draghi’s ‘Whatever it takes’ verbal intervention.\n\n",
      "categories": [],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/2020-06-10-EA-Pygmalion/"
    },{
      "image": {"path":"/assets/img/blog/example-content-iii.jpg","srcset":{"1920w":"/assets/img/blog/example-content-iii.jpg","960w":"/assets/img/blog/example-content-iii@0,5x.jpg","480w":"/assets/img/blog/example-content-iii@0,25x.jpg"}},
      "title": "An Economist's View: Working in Finance",
      "date": "2020-06-23 00:00:00 +0100",
      
      "content": "A presentation given at the Warwick Finance Society (October 2019), titled An Economist’s View: Working in Finance\n\n",
      "categories": [],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/2020-06-23-Working-in-Finance/"
    },{
      "image": {"path":"/assets/img/blog/boe.jpg","srcset":{"1920w":"/assets/img/blog/boe.jpg","960w":"/assets/img/blog/boe.jpg","480w":"/assets/img/blog/boe.jpg"}},
      "title": "Monetary policy and Covid-19",
      "date": "2020-08-11 00:00:00 +0100",
      
      "content": "The BoE as a forecast targeting central bank and what this means for the BoE’s policy response to Covid-19.\n",
      "categories": [],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/2020-08-11-Monetary-policy-and-Covid-19/"
    },{
      "image": {"path":"/assets/img/blog/brexit.jpeg","srcset":{"1920w":"/assets/img/blog/brexit.jpeg","960w":"/assets/img/blog/brexit.jpeg","480w":"/assets/img/blog/brexit.jpeg"}},
      "title": "A talk on Brexit",
      "date": "2020-11-12 00:00:00 +0000",
      
      "content": "A talk on Brexit given to the Harvard MBA class.\n",
      "categories": [],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/2020-11-12-Brexit/"
    },{
      "image": {"path":"/assets/img/blog/euro2.jpg","srcset":{"1920w":"/assets/img/blog/euro2.jpg","960w":"/assets/img/blog/euro2.jpg","480w":"/assets/img/blog/euro2.jpg"}},
      "title": "A market-based history of ECB policy events",
      "date": "2020-12-31 00:00:00 +0000",
      
      "content": "A note on ECB policy events and their market impact. Each ECB policy events is classified based on its financial market reaction. The note illustrates how the pattern of macro news at ECB policy events has changed over time.\n\n",
      "categories": [],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/2020-12-31-ECB/"
    },{
      "image": {"path":"/assets/img/blog/lego_statue.jpg","srcset":{"1920w":"/assets/img/blog/lego_statue.jpg","960w":"/assets/img/blog/lego_statue.jpg","480w":"/assets/img/blog/lego_statue.jpg"}},
      "title": "The UK productivity shortfall in an era of rising labour supply",
      "date": "2021-07-01 00:00:00 +0100",
      
      "content": "A paper on the UK’s productivity shortfall. The paper is co-authored with Garry Young at NIESR and focuses on the role of an expanding labour force and reduced capital deepening in contributing to the UK’s pre-Covid productivity slowdown.\n\nWe find that the UK’s pronounced labour force expansion accounted for 4pp of the UK’s 25 log point productivity shortfall between the mid-2000s and 2019.\n\nWe reconcile this finding with labour productivity being independent of labour supplied in the long-run and with the micro-evidence that higher inward migration has only a small effect on real wages. Both of these views depend upon the amount of capital-per-worker adjusting in response to the expanded labour force – a process that may have been slowed in the era of rising labour supply after the financial crisis.\n\n",
      "categories": [],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/2021-07-01-Productivity/"
    },{
      "image": {"path":"/assets/img/blog/euro2.jpg","srcset":{"1920w":"/assets/img/blog/euro2.jpg","960w":"/assets/img/blog/euro2.jpg","480w":"/assets/img/blog/euro2.jpg"}},
      "title": "A market-based history of ECB policy events",
      "date": "2022-02-20 00:00:00 +0000",
      
      "content": "An updated and extended version of the note on ECB policy events and their market impact.\n\nEach ECB policy event is classified based on its financial market reaction. The note illustrates how the pattern of macro news at ECB policy events has changed over time. This pattern has evolved towards ECB operating increasingly through unconventional policy and lowering risk premia.\n\n",
      "categories": [],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/2022-02-20-ECB-update/"
    },{
      "image": {"path":"/assets/img/blog/talk2.jpg","srcset":{"1920w":"/assets/img/blog/talk2.jpg","960w":"/assets/img/blog/talk2.jpg","480w":"/assets/img/blog/talk2.jpg"}},
      "title": "Central bank comms",
      "date": "2022-06-01 00:00:00 +0100",
      
      "content": "A talk on Central bank communications, financial markets and a little data science.\n\n",
      "categories": [],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/2022-06-01-cbComms/"
    },{
      "image": {"path":"/assets/img/blog/togetherCreate.jpg","srcset":{"1920w":"/assets/img/blog/togetherCreate.jpg","960w":"/assets/img/blog/togetherCreate.jpg","480w":"/assets/img/blog/togetherCreate.jpg"}},
      "title": "The UK productivity shortfall in an era of rising labour supply",
      "date": "2022-06-25 00:00:00 +0100",
      
      "content": "An updated and extended version of the paper on UK productivity growth with Garry Young at NIESR. The paper focuses on the role of an expanding labour force and reduced capital deepening in contributing to the UK’s pre-Covid productivity slowdown.\n\nWe find that the UK’s pronounced labour force expansion accounted for 4pp of the UK’s 25 log point productivity shortfall between the mid-2000s and 2019.\n\nWe reconcile this finding with labour productivity being independent of labour supplied in the long-run and with the micro-evidence that higher inward migration has only a small effect on real wages. Both of these views depend upon the amount of capital-per-worker adjusting in response to the expanded labour force – a process that may have been slowed in the era of rising labour supply after the financial crisis.\n\n",
      "categories": [],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/2022-06-25-ProductivityUpdate/"
    },{
      
      "title": "Example",
      "date": "2022-06-28 20:59:30 +0100",
      "description": "This is a featured category, which have their own page. Check out _featured_tags/example.md to learn how to create your own.\n",
      "content": "\n",
      "categories": [],
      "tags": [],
      
      "collection": "featured_categories",
      "url": "/blog/example/"
    },{
      "image": "/assets/img/projects/companies.jpeg",
      "title": "Company Behaviour",
      "date": "2020-01-01 00:00:00 +0000",
      "description": "Understanding company behaviour.\n",
      "content": "\n",
      "categories": [],
      "tags": [],
      
      "collection": "projects",
      "url": "/projects/companyBehaviour/"
    },{
      "image": "/assets/img/projects/families.jpeg",
      "title": "Family Behaviour",
      "date": "2020-01-01 00:00:00 +0000",
      "description": "Understanding family behaviour.\n",
      "content": "\n",
      "categories": [],
      "tags": [],
      
      "collection": "projects",
      "url": "/projects/familyBehaviour/"
    },{
      "image": "/assets/img/projects/housing.jpeg",
      "title": "Housing Markets",
      "date": "2020-01-01 00:00:00 +0000",
      "description": "Understanding housing markets.\n",
      "content": "\n",
      "categories": [],
      "tags": [],
      
      "collection": "projects",
      "url": "/projects/housingMarkets/"
    },{
      "image": "/assets/img/projects/jobs.jpeg",
      "title": "Labour Markets",
      "date": "2020-01-01 00:00:00 +0000",
      "description": "Understanding labour markets.\n",
      "content": "\n",
      "categories": [],
      "tags": [],
      
      "collection": "projects",
      "url": "/projects/labourMarkets/"
    },{
      "image": "/assets/img/projects/boe.jpeg",
      "title": "Monetary Policy",
      "date": "2022-01-01 00:00:00 +0000",
      "description": "Understanding monetary policy.\n",
      "content": "\n",
      "categories": [],
      "tags": [],
      
      "collection": "projects",
      "url": "/projects/monetaryPolicy/"
    }
  ]
}

